[
  {
    "item_id": 1,
    "item_name": "Bean Sprout",
    "item_nameVi": "Giá đỗ",
    "item_nameVi2": "Gia do",
    "item_sname": "Vigna radiata",
    "item_description": "Green bean is the seed of the green bean plant. It is an annual herbaceous plant with few branches, growing to a height of about 0.6 meters.\n\nThe leaves are trifoliate, oval-shaped, dark green, and covered with coarse hair. The flowers are yellow or green and form clusters in the axils. The fruit is cylindrical and held horizontally. Each pod contains 10-15 seeds separated by partitions, which are green and shiny.\n\nWhen planted, the embryo splits and then sprouts. Bean sprouts have a structure consisting of a root with three parts: leaf, root sprout, and stem sprout. The stem sprout will grow to a length of about 3-7 cm. When the leaves emerge, they are edible.\n\nGreen beans originated in India-Myanmar and were later widely cultivated in Southeast Asian countries. This is a short-day crop. The plant grows and develops in hot, humid, sunny weather, with rainfall of 200-300 mm. Depending on climate conditions, farming methods, and planting season, the harvest time will vary throughout the year.\n\nThe plant is grown throughout Vietnam, mainly for its seeds as food. Many countries in Africa and the Americas also cultivate it. The technique of growing bean sprouts is quite simple and can be done at home for daily consumption.\n\nThe amount of vitamin C begins to increase on the second day of germination and then gradually decreases. Green beans should be used 50 hours after germination when the stem has not fully grown, and the leaves have not emerged, as this provides the richest nutritional value. Sprouted green beans contain fewer calories and more free amino acids and antioxidants than unsprouted ones. Sprouting also reduces the amount of phytic acid, which is responsible for decreasing the absorption of minerals like Zinc, Magnesium, and Calcium.\n\nDuring the growth of bean sprouts, the protein, fat, and starch content in the leaves gradually decreases. In contrast, the amount of vitamins and minerals increases continuously. Therefore, the main nutritional benefit of bean sprouts is to enhance the body's intake of vitamins and minerals.",
    "item_descriptionVi": "Đỗ xanh là hạt của cây đậu xanh. Đây là loại thân thảo sống hàng năm, ít phân nhánh, cao 0.6 m.\n\nLá có 3 lá chét hình trái xoan, màu lục sẫm, có lông nháp. Hoa màu vàng hoặc lục, xếp thành chùm ở nách. Quả năm ngang hình trụ. Hạt 10- 15 phân cách nhau bởi vách, màu lục, bóng.\n\nKhi trồng, phôi sẽ tách ra rồi nảy mầm. Giá đỗ có hình dạng gồm một rễ với ba bộ phận: lá, mầm rễ, thân mầm. Thân mầm sẽ dài ra đến mức độ khoảng 3- 7cm. Khi lá lộ ra là có thể ăn được.\n\nĐỗ xanh có nguồn gốc ở Ấn Độ – Myanmar, sau đó được trồng rộng rãi ở các nước Đông Nam Á. Đây là loại cây trồng ngắn ngày. Cây sinh trưởng, phát triển trong điều kiện thời tiết nóng, ẩm, nhiều nắng, lượng mưa 200- 300 mm. Tùy vào điều kiện khí hậu, chế độ canh tác, thời vụ gieo trồng mà thời gian thu hoạch sẽ khác nhau trong năm.\n\nCây được trồng ở khắp nước ta, chủ yếu lấy hạt làm thực phẩm. Nhiều nước như châu Phi, châu Mỹ cũng trồng. Kỹ thuật trồng giá khá đơn giản, có thể tự trồng tại nhà để ăn hàng ngày.\n\nLượng vitamin C bắt đầu tăng vào ngày thứ hai của quá trình nảy mầm, sau đó thì giảm dần. Sử dụng đỗ sau nảy mầm 50 giờ, lúc thân mầm chưa sinh trưởng đầy đủ, lá chưa nhô cao sẽ cho lượng dinh dưỡng phong phú nhất. Đỗ nảy mầm chứa ít calo, nhiều acid amin tự do và chất chống oxy hóa hơn khi không cho nảy mầm. Nảy mầm còn làm giảm lượng acid phytic là nguyên nhân gây giảm hấp thu các khoáng chất như: Kẽm, Magie và Canxi.\n\nTrong quá trình giá đỗ sinh trưởng, hàm lượng protein, chất béo và tinh bột trong lá giảm dần. Ngược lại, lượng vitamin và khoáng chất không ngừng tăng cao. Vì vậy, dinh dưỡng chủ yếu từ giá là giúp nâng cao lượng vitamin và khoáng chất cho cơ thể.",
    "item_image": "beansprout",
    "item_clipart": "beansprout_clip"
  },
  {
    "item_id": 2,
    "item_name": "Bell Pepper",
    "item_nameVi": "Ớt chuông",
    "item_nameVi2": "Ot chuong",
    "item_sname": "Capsicum annuum",
    "item_description": "Bell peppers have a rich nutritional composition, including vitamin A, vitamin C, and other nutrients. A serving of 149 grams of green bell pepper provides approximately 551 IU of vitamin A, equivalent to a small cup. However, red bell peppers contain more vitamin A and are better for the development of vision and eye health. Using a cup of chopped bell peppers in various colors can provide more than 100% of the daily recommended value.\n\nThe vitamin C content in bell peppers helps the body combat oxidative stress and supports tissue health while boosting immunity. The folate content in bell peppers supports the function of red blood cells and is particularly important for women during pregnancy, as it may help prevent certain birth defects in the fetus.\n\nBell peppers are also a rich source of vitamin K, which is essential for blood clotting functions. All bell peppers, regardless of color, provide high levels of potassium. This mineral helps maintain fluid and mineral balance in the body, enhances muscle function, and regulates stable blood pressure.\n\nThe compounds found in bell peppers, especially in red bell peppers, are abundant in phytochemicals and carotenoids, particularly beta-carotene, which have strong antioxidant and anti-inflammatory effects.",
    "item_descriptionVi": "Ớt chuông có thành phần chất dinh dưỡng khá giàu gồm: vitamin A, vitamin C và các chất dinh dưỡng khác. Hàm lượng vitamin A trong 149 gam chuông xanh cung cấp khoảng 551 IU vitamin A, tương đương với một chén nhỏ. Tuy nhiên, hàm lượng vitamin A trong ớt chuông đỏ nhiều hơn và tốt hơn cho sự phát triển của thị lực và mắt. Sử dụng một chén ớt xắt nhỏ với nhiều màu sắc có thể cung cấp hơn 100% giá trị hàng ngày.\n\nĐối với hàm lượng vitamin C trong ớt chuông có tác dụng giúp cơ thể chống lại các tác nhân của quá trình oxy hóa đồng thời hỗ trợ sức khoẻ của các mô cũng như nâng cao khả năng miễn dịch. Hàm lượng chất folate có trong ớt chuông có tác dụng hỗ trợ chức năng của các tế bào hồng cầu và đặc biệt hợp chất này khá quan trọng với phụ nữ khi đang trong thời kỳ mang thai, vì nó có thể giúp ngăn ngừa một số tình trạng khuyết tật bẩm sinh ở thai nhi.\n\nỚt chuông cũng thuộc nguồn thực phẩm cung cấp phong phú hàm lượng vitamin K. Vitamin này rất cần thiết cho các chức năng đông máu. Tất cả ớt chuông với các màu khác nhau đều cung cấp hàm lượng kali cao. Khoáng chất này có tác dụng giúp giữ chất lỏng và khoáng chất cân bằng trong cơ thể, đồng thời tăng cường chức năng cơ bắp, đồng thời điều hòa huyết áp ổn định.\n\nThành phần các hợp chất chứa trong ớt chuông, đặc biệt ớt chuông đỏ khá phong phú với các hợp chất như: Phytochemical, caroteinoid, đặc biệt beta caroten đều có tác dụng tốt để chống oxy hoá và chống viêm.",
    "item_image": "bell_pepper",
    "item_clipart": "bell_pepper_clip"
  },
  {
    "item_id": 3,
    "item_name": "Bitter Melon",
    "item_nameVi": "Khổ qua",
    "item_nameVi2": "Kho qua",
    "item_sname": "Momordica charantia",
    "item_description": "Bitter melon, also known as bitter gourd, belongs to the gourd family and is widely favored and commonly grown in Vietnam. It has an oblong shape with a bumpy exterior that is green when unripe and turns yellow-red like a peach when ripe. In modern medical studies, scientists have found that bitter melon contains many vitamins and minerals beneficial to health, such as proteins, lipids, carbohydrates, calcium, potassium, magnesium, iron, and more. According to traditional Eastern medicine, bitter melon has a bitter, cold taste and has the effect of clearing heat and detoxifying the body.\n\nBitter melon is very rich in vitamin C, a powerful antioxidant that helps eliminate free radicals in the body, thereby supporting the improvement of the immune system. You can boil bitter melon and drink the water daily to prevent infections and other diseases. Bitter melon contains phytonutrient Polypeptide-P, a plant insulin that lowers blood sugar levels. It also produces hypoglycemic agents called Charantin, which improve glycogen synthesis in the body. Bitter melon contains beta-carotene, which helps reduce eye infections and improve vision. Its high fiber content aids in digestion and helps prevent gastrointestinal diseases. For people with digestive issues such as stomach pain, colitis, or constipation, bitter melon is an excellent remedy. It also helps reduce cholesterol levels in the body, improves arterial function, and prevents heart disease. Therefore, eating bitter melon regularly can promote a healthy and long life. Bitter melon is rich in antioxidants, which are useful for eliminating toxins from the body. Additionally, due to its distinctive bitter flavor, it helps inhibit the stimulation of the body's thermoregulatory center, thereby cooling the body. This makes it beneficial for the liver, gallbladder, and helps purify the blood.\n\nThe large amount of protein and vitamin C in bitter melon enhances the body's immune function, enabling immune cells to destroy cancer cells. Furthermore, bitter melon juice contains a protein-like compound similar to alkaloids, which strengthens the phagocytic function of macrophages. Both the seeds and the fruit of bitter melon exhibit anti-leukemic and antiviral activity. Bitter melon extract inhibits the growth and activity of guanylate cyclase in prostate cancer, ultimately preventing the growth of prostate cancer cells in vitro.\n\nDespite the many benefits of bitter melon, it is contraindicated for certain groups, such as pregnant and breastfeeding women, people with low blood pressure, as excessive consumption may cause headaches and dizziness, and individuals experiencing low blood sugar.",
    "item_descriptionVi": "Khổ qua hay còn gọi là mướp đắng, thuộc họ bầu bí được ưa chuộng và trồng phổ biến tại Việt Nam. Chúng có hình thoi với hình dáng bên ngoài có nhiều u lồi khi sống có màu xanh và chuyển sang màu vàng đỏ như đào khi chín. Trong các nghiên cứu y học hiện đại, các nhà khoa học nhận thấy rằng khổ qua có chứa rất nhiều sinh tố và khoáng chất tốt cho sức khỏe như protein, lipit, cacbon hydrat, canxi, kali, magie, sắt… còn theo Đông y, mướp đắng vị đắng, lạnh và có tác dụng thanh nhiệt, giải độc.\n\nMướp đắng rất giàu vitamin C, một chất chống oxy hóa mạnh giúp loại bỏ các gốc tự do trong cơ thể. Do đó, chúng hỗ trợ cải thiện hệ thống miễn dịch của cơ thể. Bạn có thể luộc mướp đắng rồi uống nước hàng ngày để chống nhiễm trùng và các bệnh khác. Mướp đắng chứa phytonutrient, Polypeptide-P, một insulin thực vật làm giảm lượng đường trong máu. Nó cũng tạo ra các tác nhân hạ đường huyết gọi là Charantin để cải thiện quá trình tổng hợp glycogen trong cơ thể. Mướp đắng chứa beta-carotene, có tác dụng trong việc giảm nhiễm trùng mắt cũng như cải thiện thị lực. Mướp đắng chứa nhiều chất xơ giúp thực phẩm được tiêu hóa dễ dàng, ngăn chặn, phòng chống các bệnh về đường tiêu hóa. Đối với những người bị các vấn đề về đường ruột như đau dạ dày, đại tràng, táo bón thì mướp đắng là bài thuốc chữa bệnh tuyệt vời. Mướp đắng giúp giảm mức cholesterol trong cơ thể, cải thiện chức năng động mạch và ngăn ngừa bệnh tim. Vì vậy, hãy ăn mướp đắng thường xuyên để có một cuộc sống khỏe mạnh và lâu dài. Mướp đắng rất giàu chất chống oxy hóa, rất hữu ích trong việc đào thải các độc tố ra khỏi cơ thể. Bên cạnh đó, do chứa chứa thành phần vị đắng đặc thù nên mướp đắng còn có tác dụng ức chế quá trình hưng phấn của trung tâm điều nhiệt trong cơ thể giúp giải nhiệt. Chính vì thế, chúng rất tốt cho gan mật và làm mát máu.\n\nHàm lượng lớn protein và vitamin C trong quả khổ qua giúp nâng cao chức năng miễn dịch của cơ thể, làm cho tế bào miễn dịch có tác dụng tiêu diệt tế bào ung thư. Thêm vào đó, nước cốt mướp đắng chứa thành phần protein tựa như hoạt chất Alkaloid, giúp tăng cường chức năng nuốt của các thực bào, hạt và quả khổ qua có hoạt tính chống ung thư bạch cầu và chống vi rút. Cao khổ qua ức chế tăng trưởng và hoạt tính guanilate cyclasecủa ung thư tuyến tiền liệt, kết quả là ngăn chặn sự tăng trưởng tế bào ung thư tuyến tiền liệt trong ống nghiệm.\n\nMặc dù khổ qua có nhiều tính năng hữu ích, thế nhưng loại dược liệu này cũng là tối kỵ với một số nhóm đối tượng như phụ nữ mang thai và cho con bú, người bị bệnh huyết áp thấp ăn nhiều gây đau đầu, chóng mặt, người bệnh đang có biểu hiện đường huyết xuống thấp.",
    "item_image": "bitter_melon",
    "item_clipart": "bitter_melon_clip"
  },
  {
    "item_id": 4,
    "item_name": "Bokchoy",
    "item_nameVi": "Cải thìa",
    "item_nameVi2": "Cai thia",
    "item_sname": "Brassica rapa chinensis",
    "item_description": "Bokchoy is a type of leafy green vegetable in the Brassica family, alongside cabbage, kale, cauliflower, radishes, and broccoli. While this plant may be relatively new to the West, it has been cultivated in Asia for thousands of years.\n\nThe terms \"bok choy\" or \"pak choy\" can cause confusion for gardeners, as this vegetable is known by many names, including Chinese celery, Chinese cabbage, and various others. The names also vary across different Asian dialects. To avoid further confusion, the name of the vegetable often changes depending on its specific type or variety.\n\nOverall, regardless of the variety, this vegetable is known for its health benefits. Bok choy contains high levels of nutrients, including fiber, vitamin C, vitamin K, iron, and potassium.\n\nThis leafy green can be enjoyed both raw and cooked, though recent research suggests that light steaming provides the most health benefits.\n\nFirst, those looking to improve bone health should regularly eat bok choy. It is an excellent source of calcium, an essential mineral for strong bones. Additionally, the vitamin K in bok choy plays a role in bone metabolism and reduces the risk of fractures.\n\nAnother group that should regularly consume bok choy are those wanting to strengthen their immune system. This is because bok choy is rich in vitamin C. In fact, this vitamin acts as an antioxidant that supports immune function, helping the body defend against common illnesses like colds or the flu.\n\nIn addition to vitamin C, bok choy contains other antioxidants, such as quercetin. These compounds help reduce inflammation and prevent cell damage in the body. Not just bok choy, but other leafy greens like kale, spinach, and broccoli are also rich in these antioxidants.\n\nMoreover, people looking to lose weight, maintain their weight, or improve digestion should eat bok choy. It is high in water content, fiber, and low in calories. Bok choy helps with feeling full, reducing hunger, aiding digestion, and making weight loss easier.\n\nThis leafy green is also beneficial for those wanting to maintain healthy vision. Bok choy contains important nutrients like vitamin A and beta-carotene, a precursor to vitamin A.",
    "item_descriptionVi": "Rau cải thìa là một loại rau thuộc họ cải cùng với bắp cải, cải xoăn, súp lơ trắng, củ cải và bông cải xanh. Loại cây này có thể tương đối mới đối với phương Tây, nhưng chúng đã được trồng ở châu Á trong hàng nghìn năm.\n\nRau Cải thìa hay thuật ngữ “bok choy” hoặc “pak choy” có xu hướng gây nhầm lẫn cho những người làm vườn. Bởi loại rau này được biết đến với rất nhiều tên, bao gồm cần tây Trung Quốc, cải Trung Quốc, Cải thìa và nhiều loại khác. Các tên cũng khác nhau theo phương ngữ châu Á. Để tránh gây nhầm lẫn hơn nữa, tên của loại rau thường thay đổi tùy theo các loại và giống cụ thể.\n\nNhìn chung, dù thuộc giống cải nào thì loại rau này đều được biết đến với những tác dụng có lợi cho sức khỏe. Trong rau Cải thìa chứa hàm lượng lớn chất dinh dưỡng, bao gồm chất xơ, vitamin C, vitamin K, sắt và kali.\n\nLoại rau xanh này có thể được thưởng thức cả sống và chín. Nhưng nghiên cứu gần đây cho thấy rằng việc hấp nhẹ nhàng mang lại nhiều lợi ích sức khỏe nhất.\n\nĐầu tiên, những người muốn cải thiện sức khỏe xương nên thường xuyên ăn cải thìa. Loại rau này là nguồn cung cấp canxi tuyệt vời. Canxi là khoáng chất quan trọng giúp xương chắc khỏe. Ngoài ra, hàm lượng vitamin K trong cải thìa cũng có tác dụng tăng cường trong quá trình chuyển hóa xương và giảm nguy cơ gãy xương.\n\nMột nhóm khác cũng nên ăn cải thìa thường xuyên là những người muốn củng cố hệ miễn dịch. Điều này là do cải thìa giàu vitamin C. Trên thực tế, loại vitamin này là một chất chống oxy hóa có tác dụng hỗ trợ chức năng miễn dịch, bảo vệ cơ thể chống lại các tác nhân gây bệnh thông thường, chẳng hạn như cảm lạnh hay cúm.\n\nNgoài vitamin C, cải thìa còn chứa nhiều chất chống ô xy hóa khác, chẳng hạn như quercetin. Những chất này giúp giảm viêm nhiễm và tổn thương tế bào trong cơ thể. Không chỉ cải thìa mà các loại rau lá xanh khác như cải xoăn, chân vịt hay bông cải xanh cũng giàu các chất chống ô xy hóa này.\n\nNgoài ra, những người đang tìm cách giảm cân, duy trì cân nặng hoặc cải thiện tiêu hóa cũng nên ăn cải thìa. Điều này là do cải thìa có nhiều nước, hàm lượng chất xơ cao và lượng calo thấp. Cải thìa sẽ giúp nó lâu, giảm cảm giác thèm ăn, hỗ trợ tiêu hóa và giúp quá trình giảm cân dễ dàng hơn.\n\nLoại rau lá xanh này cũng có lợi cho những người muốn duy trì thị lực khỏe mạnh. Thành phần quan trọng trong cải thìa là vitamin A và beta-carotene, một dạng tiền chất của vitamin A.",
    "item_image": "bokchoy",
    "item_clipart": "bokchoy_clip"
  },
  {
    "item_id": 5,
    "item_name": "Broccoli",
    "item_nameVi": "Súp lơ xanh",
    "item_nameVi2": "Sup lo xanh",
    "item_sname": "Brassica oleracea var. italica",
    "item_description": "Broccoli is a vegetable in the Brassica family, related to cabbage, kale, cauliflower, and Brussels sprouts. It comes in green or purple varieties, with a flower-like shape, and can be consumed both raw or cooked, offering impressive health benefits.\n\nIn 91 grams of fresh broccoli, there are approximately 31 calories, 89% water, 2.5g of protein, 6g of carbohydrates, 2.4g of fiber, and 0.4g of fat. Broccoli also provides important vitamins and minerals such as vitamin C (135% of the RDI), vitamin K (116% of the RDI), vitamin A (11% of the RDI), folate (14% of the RDI), and potassium (8% of the RDI). Additionally, broccoli contains various antioxidants and compounds with anti-inflammatory and anti-cancer properties like glucoraphanin, kaempferol, lutein, and zeaxanthin.\n\nThe broccoli plant has a small, upright stem, growing to about 30cm in height at maturity. Its leaves are relatively small, silver-green, similar to cabbage leaves but with more pronounced waves along the edges, and prominent veins on the surface. At the top of the stem is a large cluster of florets, divided into many lobes, with a plump surface covered by a deep green color. This is the most commonly used part of the plant for human consumption.\n\nBroccoli can be eaten raw or cooked, both of which provide health benefits, though their nutritional composition differs. Different cooking methods like boiling, stir-frying, or steaming can alter the nutritional content, especially for vitamin C, protein, and sugar. Steaming is the method that preserves the most nutrients.\n\nRegardless of whether it's steamed or eaten raw, broccoli offers a good supply of vitamin C for the body. About 78g of cooked broccoli provides 84% of the recommended daily intake of vitamin C.",
    "item_descriptionVi": "Bông cải xanh là một loại rau thuộc họ cải, có liên quan đến bắp cải, cải xoăn, súp lơ và cải Brussels. Súp lơ có màu xanh lá cây hoặc tím, hình dạng giống như hoa, ăn tươi hay nấu chín đều có những lợi ích đáng kinh ngạc cho sức khỏe.\n\nTrong 91g bông cải xanh tươi có khoảng 31 calo, 89% nước, 2,5g protein, 6g carbohydrate, 2,4g chất xơ và 0,4g chất béo. Súp lơ xanh còn cung cấp nhiều vitamin và khoáng chất quan trọng như vitamin C (135% RDI), vitamin K (116% RDI), vitamin A (11% RDI), folate (14% RDI) và kali (8% RDI). Ngoài ra, bông cải xanh cũng chứa nhiều chất chống oxy hóa và các hợp chất có tác dụng chống viêm và chống ung thư như: Glucoraphanin, kaempferol, lutein và zeaxanthin.\n\nCây súp lơ xanh có thân nhỏ, mọc thẳng đứng và chiều cao ở giai đoạn trưởng thành khoảng 30cm. Kích thước lá khá bé, màu xanh bạc tương tự lá bắp cải nhưng đường viền uốn lượn mạnh hơn, gân nổi rõ trên bề mặt. Trên đỉnh ngọn có khóm hoa cỡ lớn, chia làm nhiều thùy, bề mặt đầy đặn và bao phủ bên ngoài là màu xanh lục đậm. Đây chính là phần được sử dụng nhiều nhất để làm thức ăn cho con người.\n\nBông cải xanh có thể ăn tươi hoặc nấu chính, cả hai cách sử dụng này đều có lợi cho sức khỏe nhưng có thành phần dinh dưỡng khác nhau. Những phương pháp chế biến khác nhau như luộc, xào hoặc hấp có thể thay đổi thành phần dinh dưỡng của chúng, đặc biệt là vitamin C, protein và đường. Hấp chín là phương pháp giúp bảo tồn được các chất dinh dưỡng tốt nhất.\n\nTuy vậy, việc hấp chín hay ăn tươi đều cung cấp lượng vitamin C tốt cho cơ thể. Khoảng 78g bông cải xanh nấu chín sẽ cung cấp 84% nhu cầu năng lượng tối thiểu cho cơ thể.",
    "item_image": "broccoli",
    "item_clipart": "broccoli_clip"
  },
  {
    "item_id": 6,
    "item_name": "Cabbage",
    "item_nameVi": "Bắp cải",
    "item_nameVi2": "Bap cai",
    "item_sname": "Brassica oleracea var. capitata",
    "item_description": "Cabbage is a vegetable belongs to the Brassica family. It is a temperate vegetable that has been cultivated in Vietnam for a long time. The main cabbage varieties only form heads when the temperature is below 20°C. However, heat-tolerant cabbage varieties (mainly hybrids) can still form heads at temperatures of 25°C to 27°C.\n\nCabbage is grown in many areas in the northern provinces of Vietnam. In the past, cabbage was a specialty of Da Lat in the South, but nowadays, it is widely cultivated in suburban districts of Ho Chi Minh City and the Mekong Delta, producing a significant amount of cabbage.\n\nAdditionally, cabbage is high in fiber and contains strong antioxidants, including polyphenols and sulfur compounds. When comparing the colors of cabbages, experts have found that red cabbage contains more of these compounds than green cabbage. Antioxidants help protect the body from damage caused by free radicals. Free radicals are unstable molecules with unpaired electrons, which make them unstable. When free radicals are too abundant and unstable, they can damage cells. Cabbage also contains vitamin B6 and folate, both essential for many important bodily processes, such as energy metabolism and proper functioning of the nervous system.\n\nCabbage is particularly rich in vitamin C, a powerful antioxidant that can protect against heart disease, certain cancers, and vision loss. For a long time, the consumption of fruits and vegetables has been associated with a reduced risk of many harmful diseases. Numerous studies suggest that increasing the intake of plant-based foods like cabbage reduces the risk of diabetes, obesity, heart disease, and overall mortality. It can also help build healthy skin, boost energy levels, and promote weight loss.\n\nCabbage is commonly used in dishes such as boiled cabbage, stir-fried with lean meat or shrimp like other stir-fried vegetables, as a salad ingredient, or pickled to eat with crunchy flavors (by adding herbs, garlic, sugar, salt, and chili). If there's an abundance of cabbage, it can be fermented and stored as pickles for future use. Cabbage leaves are also often used to wrap meat and steam, creating a nutritious dish.",
    "item_descriptionVi": "Bắp cải còn có tên gọi khác là quyển tâm thái, cải bắp, sú, thuộc họ cải Brassica.\n\nBắp cải thuộc cây rau ôn đới được nhập vào trồng ở nước ta từ lâu. Những giống cải bắp chính vụ, chỉ cuốn bắp khi nhiệt độ dưới 20 độ C. Tuy nhiên những giống cải bắp chịu nhiệt (chủ yếu những giống lai) vẫn vào bắp ở nhiệt độ 25 độ C - 27 độ C.\n\nBắp cải được trồng ở nhiều nơi thuộc các tỉnh phía Bắc. Ở miền Nam trước đây bắp cải là đặc sản của Đà Lạt, nhưng ngày nay nhiều huyện ở ngoại thành TP. Hồ Chí Minh và vùng đồng bằng sông Cửu Long đã trồng bắp cải rất nhiều, thu hoạch được một lượng rau đáng kể.\n\nNgoài ra, bắp cải có nhiều chất xơ và chứa chất chống oxy hóa mạnh, bao gồm polyphenol và các hợp chất lưu huỳnh. Khi so sánh màu sắc của cải bắp, các chuyên gia nhận thấy rằng loại bắp cải có màu đỏ có chứa nhiều hợp chất này hơn so với bắp cải màu xanh. Chất chống oxy hóa có tác dụng bảo vệ cơ thể không bị tổn thương do các gốc tự do gây ra. Gốc tự do là các phân tử có số electron lẻ, làm cho chúng không ổn định. Khi các gốc tự do này quá nhiều và hoạt động không ổn định, chúng có thể làm hỏng các tế bào, bắp cải có chứa vitamin B6 và folate, cả hai đều rất cần thiết cho nhiều quá trình quan trọng trong cơ thể, như quá trình chuyển hóa năng lượng trong cơ thể và hoạt động bình thường của hệ thần kinh. Bắp cải đặc biệt chứa nhiều vitamin C, một chất chống oxy hóa mạnh có thể bảo vệ chống lại bệnh tim, một số bệnh ung thư và giảm thị lực.\n\nBắp cải đặc biệt chứa nhiều vitamin C, một chất chống oxy hóa mạnh có thể bảo vệ chống lại bệnh tim, một số bệnh ung thư và giảm thị lực. Từ lâu, ăn trái cây và rau quả có liên quan đến việc giảm nguy cơ mắc nhiều bệnh có hại cho sức khỏe. Nhiều nghiên cứu cho thấy rằng, việc tăng cường tiêu thụ thực phẩm có nguồn gốc thực vật như bắp cải làm giảm nguy cơ mắc bệnh tiểu đường, béo phì, bệnh tim và tỷ lệ tử vong chung. Nó cũng có thể giúp xây dựng làn da khỏe mạnh, tăng cường năng lượng và giảm trọng lượng tổng thể.\n\nBắp cải thường dùng chế biến các loại thức ăn như luộc, xào với thịt nạc và tôm như các món rau xào khác, làm nộm, muối xổi ăn giòn (thêm rau răm, tỏi, đường, muối, ớt). Bắp cải nếu nhiều có thể nén làm dưa để ăn dần. Lá bắp cải thường cuốn thịt, hấp ăn cũng là một món ăn khá bổ dưỡng.",
    "item_image": "cabbage",
    "item_clipart": "cabbage_clip"
  },
  {
    "item_id": 7,
    "item_name": "Carrot",
    "item_nameVi": "Cà rốt",
    "item_nameVi2": "Ca rot",
    "item_sname": "Daucus carota",
    "item_description": "Carrots are a root vegetable that typically come in red, yellow, white, or purple colors. The edible part of the carrot is the root, which is rich in pro-vitamin A, beneficial for eye health.\n\nIn nature, carrots are biennial plants, growing a rosette of leaves in the spring and summer while accumulating a large amount of sugar in their thickened taproot, storing energy for flowering in the second year. The flowering stem can grow up to 1 meter (3 feet) tall, bearing an umbel of small white flowers that produce fruit, known to botanists as schizocarps. Carrots were first cultivated in Afghanistan around 900 AD. Many people recognize the vibrant orange color of carrots, but in reality, they also come in other colors such as purple, yellow, red, and white.\n\nCarrots contain a sufficient amount of sodium to help maintain healthy blood pressure levels in the body. Those who regularly consume carrots tend to have a higher rate of maintaining healthy blood pressure compared to the average.\n\nWith abundant antioxidants, beta carotene, vitamins, and minerals, carrots are considered one of the best foods for health. Carrots are particularly good for improving vision, preventing cancer, aiding in diabetes management, enhancing skin beauty, maintaining body shape, and have even been used in vaccines against the HIV virus.\n\nAlthough carrots are healthy, consuming too much beta-carotene can cause your skin to turn yellow-orange. This condition, known as carotenemia, is relatively harmless and treatable. However, in severe cases, carotenemia can interfere with vitamin A function, affecting vision, bones, skin, metabolism, or your immune system.\n\nSome individuals are also allergic to compounds in carrots. If you experience hives, swelling, or difficulty breathing after eating carrots, immediate medical attention is needed. In severe cases, it can lead to anaphylaxis, a rapidly progressing and life-threatening reaction. People with a history of carrot allergies should carefully check the ingredients in smoothies, vegetable soups, and various other products before consuming.",
    "item_descriptionVi": "Cà rốt là một loại cây có củ, thường có màu đỏ, vàng, trắng hay tía. Phần ăn được của cà rốt là củ, thực chất là rễ cái của nó, chứa nhiều tiền tố của vitamin A tốt cho mắt.\n\nTrong tự nhiên, nó là loại cây sống hai năm, phát triển một nơ chứa lá trong mùa xuân và mùa hè, trong khi đó vẫn tích lũy một lượng lớn đường trong rễ cái to mập, tích trữ năng lượng để ra hoa trong năm thứ hai. Thân cây mang hoa có thể cao tới 1m (3ft), với hoa tán chứa các hoa nhỏ màu trắng, sinh ra quả, được các nhà thực vật học gọi là quả nẻ. Cà rốt được trồng đầu tiên ở Afghanistan vào khoảng năm 900 sau Công nguyên. Nhiều người biết đến cà rốt với màu cam rực rỡ đặc trưng, nhưng thực tế thì loại củ này cũng có các màu sắc khác, chẳng hạn như tím hoặc vàng, đỏ và trắng.\n\nCà rốt là loại củ chứa lượng natri vừa đủ để duy trì huyết áp ở mức hợp lý trong cơ thể. Đối với những người tiêu thụ cà rốt thường xuyên sẽ có tỷ lệ duy trì huyết áp ở mức khỏe mạnh cao hơn so với mức trung bình.\n\nVới hàm lượng chất chống oxy hóa, beta carotene, các vitamin và khoáng chất dồi dào, cà rốt được xem là một trong những thực phẩm cực tốt cho sức khỏe. Cà rốt làm tốt vai trò cải thiện thị lực, ngăn chặn tế bào ung thư, tốt cho bệnh tiểu đường, làm đẹp da, giữ dáng thậm chí còn được sử dụng để làm vắc xin chống lại virus HIV.\n\nMặc dù cà rốt có tốt cho sức khỏe, nhưng nếu nạp quá nhiều beta-carotene, làn da của bạn có thể chuyển sang màu vàng cam. Tình trạng này được gọi là Thâm nhiễm caroten trong máu (carotenemia), tương đối vô hại và có thể điều trị được. Nhưng trong trường hợp nặng, carotene huyết có thể cản trở chức năng của vitamin A, làm ảnh hưởng đến thị lực, xương, da, trao đổi chất hoặc hệ thống miễn dịch của bạn.\n\nMột số người cũng bị dị ứng với các hợp chất trong cà rốt. Nếu gặp triệu chứng nổi mề đay, sưng và khó thở sau khi ăn cà rốt thì cần được chăm sóc y tế khẩn cấp. Khi các triệu chứng trở nên nghiêm trọng, người bệnh có thể bị sốc phản vệ - một phản ứng tiến triển nhanh chóng và đe dọa tính mạng. Người có tiền sử dị ứng với cà rốt nên kiểm tra cẩn thận các thành phần trong sinh tố, súp rau củ và một loạt các sản phẩm khác trước khi dùng.",
    "item_image": "carrot",
    "item_clipart": "carrot_clip"
  },
  {
    "item_id": 8,
    "item_name": "Cauliflower",
    "item_nameVi": "Súp lơ trắng",
    "item_nameVi2": "Sup lo trang",
    "item_sname": "Brassica oleracea var. botrytis",
    "item_description": "Cauliflower, also known as white cabbage, broccoli, or simply cauliflower, is an edible vegetable belonging to the species Brassica oleracea in the mustard family (Brassicaceae). It grows year-round and is propagated by seeds. The part of the cauliflower used as food is the entire undeveloped flower, which is soft and spongy, making it sensitive to rain and sunlight. The leaves and stems are usually used as livestock feed.\n\nCauliflower has well-developed leaves, but its roots are shallow, typically growing in the top 10–15 cm of soil, and spread minimally, making it less drought- and water-resistant. It is a herbaceous plant that can live for two years, thrives in moist, humus-rich soil, and requires high levels of nutrients. It prefers light shade and can tolerate cold temperatures. The optimal temperature for growth is 15–18°C, and above 25°C, the plant grows poorly, ages quickly, produces small flowers, and blooms prematurely. However, if the temperature drops below 10°C during the flowering stage, the flowers will also be small and of poor quality.\n\nAccording to some sources, cauliflower originated in the ancient Mediterranean. It is a well-known and popular vegetable, appreciated for its sweet, crispy, and delicious taste, as well as its ease of cultivation and preparation. Today, cauliflower is widely grown in many parts of the world. In Vietnam, it is commonly cultivated in cold regions such as the northern areas during winter or highland regions like the Central Highlands, particularly in Da Lat, Lam Dong province.\n\nCauliflower is a herbaceous plant that can grow up to 50 cm tall and has a lifespan of about two years. Its roots are shallow, spreading only about 10 cm deep. The leaves spread widely to both sides, with wavy edges. The leaf blades resemble those of kohlrabi, thick, tough, and large, with a deep green color and prominent central veins. The flower cluster is large and rough in texture, concentrated at the top of the plant. The surface is covered with small grain-like bumps scattered evenly. The florets are tightly packed, soft, and spongy, surrounded by the plant's leaves. Additionally, the fruit is narrow and long, with a cone-shaped tip.\n\nDepending on different culinary purposes, cauliflower can be used in various ways and quantities. It can be enjoyed through methods such as steaming, boiling, roasting, or stir-frying. Cauliflower is also versatile as a substitute for grains, used in dishes like cauliflower rice, mashed vegetables, pasta, or pickles. Due to its low calorie and carbohydrate content, it can replace rice in fried rice dishes, combined with eggs and other vegetables. This makes cauliflower a light yet nutritious dish, suitable for people on a diet.",
    "item_descriptionVi": "Bông cải trắng hay còn gọi là súp lơ, hay su lơ, bắp su lơ, hoa lơ, cải hoa hay cải bông trắng là một loại cải ăn được, thuộc loài Brassica oleracea, họ Cải, mọc quanh năm, gieo giống bằng hạt. Phần sử dụng làm thực phẩm của súp lơ là toàn bộ phần hoa chưa nở, phần này rất mềm, xốp nên không chịu được mưa nắng. Phần lá và thân thường chỉ được sử dụng làm thức ăn cho gia súc.\n\nSúp lơ có phần lá rất phát triển, nhưng bộ rễ lại phát triển kém thường ăn nông (ở lớp đất 10 – 15 cm) và ít lan rộng, vì thế tính chịu hạn, chịu nước kém. Cây thân thảo, có thể sống 2 năm, ưa đất ẩm, nhiều mùn yêu cầu về dinh dưỡng khá cao, cây thích ánh sáng nhẹ, chịu được lạnh; nhiệt độ thích hợp nhất cho sinh trưởng và phát triển là 15-18 độ C, từ 25 độ C trở lên cây mọc kém, chậm, mau hóa già, cho hoa bé và dễ nở. Tuy nhiên, ở giai đoạn đang ra hoa nếu gặp phải nhiệt độ dưới 10 độ C hoa cũng bị bé, phẩm chất kém.\n\nTheo một số tài liệu, bông cải trắng có nguồn gốc từ Địa Trung Hải xa xưa. Là thực phẩm nổi tiếng, được ưa chuộng bởi vị ngọt, giòn, thơm ngon, dễ chăm sóc và chế biến. Ngày nay, cây phân bố rộng rãi nhiều nơi khắp trên thế giới. Ở Việt Nam, các vùng trồng súp lơ phổ biến là miền có khí hậu lạnh như miền Bắc vào mùa Đông hay các vùng núi cao như Tây Nguyên, nhất là vùng Đà Lạt Lâm Đồng.\n\nThuộc loài cây thân thảo, cao có thể tới 50 cm, sống trong vòng khoảng 2 năm. Phần rễ cây phát triển kém, nông (khoảng 10cm đất), ít lan rộng. Lá có tán xòe rộng ra hai bên, mép lượn sóng. Phiến lá tương tự lá su hào, cứng, dày to, sắc xanh đậm, ở giữa có gân lá lớn. Cụm hoa có dạng đài to, hình dáng bề mặt sần sùi, tập trung ở ngọn. Trên bề mặt có những nốt nhỏ như gạo lấm tấm phân bố rải rác đều khắp. Phần bông phân bố khít nhau, mềm xốp, được bao phủ bên ngoài bởi lá cây. Ngoài ra, quả hẹp và dài, có một mỏ hình nón.\n\nTùy theo các mục đích sử dụng, món ăn khác nhau mà có thể dùng thực phẩm với nhiều cách và liều lượng không giống nhau. Bông cải trắng có thể được thưởng thức qua các hình thức chế biến như hấp, luộc, nướng, xào… Có thể linh hoạt thay thế cho các loại ngũ cốc, làm cơm, rau nghiền, mì ống hoặc muối chua… Do chứa ít calo và carbohydrat, nguyên liệu có thể thay cho cơm trong món cơm chiên thông thường, kết hợp với trứng và một số rau củ khác… Đây là một món ăn thanh đạm mà vẫn bổ dưỡng, thích hợp cho người ăn kiêng.",
    "item_image": "cauliflower",
    "item_clipart": "cauliflower_clip"
  },
  {
    "item_id": 9,
    "item_name": "Chayote",
    "item_nameVi": "Su su",
    "item_nameVi2": "Su su",
    "item_sname": "Sechium edule",
    "item_description": "Chayote, also known as su le, is a type of plant belonging to the gourd family, which includes cucumbers and watermelons. It typically grows on trellises or even spreads along the ground, with large and broad leaves. Although the main part of the plant cultivated for use is the fruit, the shoots of the chayote plant can also be used in various dishes. The fruit can be prepared in many ways, such as boiling, stir-frying, steaming, or cooking in soups, while the shoots are often added to hot pots. In Vietnam, chayote is commonly grown in mountainous regions and climbs on trellises along hillsides.\n\nThe chayote vine can grow 6-8 meters long, and if it thrives, it can reach up to 12 meters. The leaves are more than 10 cm long and 5-7 cm wide. The flowers are small, with a diameter of about 3-5 cm. The fruit is about 15 cm long. Chayote is a soft, climbing plant with tendrils to help it climb higher. The stem is fine-haired with vertical ridges running along it. The leaves are large and shiny, shaped like a webbed foot with five lobes. The tendrils are divided into 3-5 branches to help the plant grip as it climbs. Chayote has small, unisexual flowers, with solitary female flowers usually growing in leaf axils, and a single ovary with one ovule. The fruit is pear-shaped with prominent vertical ridges and a rough texture. The skin of the fruit is thin, and the flesh is thick, with a single large, flat oval seed inside.\n\nChayote shoots are rich in folate, fiber, copper, zinc, and B vitamins, which help prevent the formation of homocysteine, a substance that can cause heart disease and stroke. The vitamins C and K in chayote help with antioxidant activity and osteoporosis prevention.\n\nThe fruit of the chayote is mild and tasty and can be boiled, stir-fried, stewed with meat, made into soup, or prepared as salads. It can also be pickled in brine. The flesh of the fruit can be ground into powder (1 kg of fruit yields about 13 g of fine white powder), and the remaining pulp can be used as livestock feed. This powder can be used to make cakes with eggs, milk, and sugar. The young shoots of the chayote plant can be eaten as vegetables, similar to green beans, and can be stir-fried or mixed with eggs (similar to asparagus with eggs). The tubers that form in the roots of plants that are 2-3 years old can weigh between 200 g and 1 kg. These young tubers can be cooked and used as a substitute for potatoes.",
    "item_descriptionVi": "Su su, hay còn được biết đến với tên gọi su le, là một loại cây thuộc họ nhà bầu bí, dưa chuột và dưa hấu. Thường leo trên giàn hoặc thậm chí mọc trên mặt đất, cây này có lá to và rộng. Mặc dù quả su su là phần chính được trồng để sử dụng, nhưng ngọn của cây cũng có thể được sử dụng trong các món ăn. Quả su su có thể được chế biến thành nhiều món như luộc, xào, hấp, nấu canh, trong khi ngọn có thể được thêm vào lẩu. Tại Việt Nam, su su thường được trồng nhiều ở các vùng núi và leo trèo trên các giàn ở các sườn núi.\n\nSu Su có dây dài 6-8 m, nếu phát triển tốt có thể đến 12 m. Lá dài khoảng hơn 10cm rộng 5-7cm. Hoa nhỏ với đường kính khoản 3-5cm. Quả dài tầm 15cm. Su Su là cây thân leo mềm có các tua bám để leo cao hơn. Thân cây có lông mịn có các đường kẻ dọc thẳng theo thân. Lá Su Su to, bóng, lá có dạng hình chân vịt, có 5 thuỳ, tua cuốn chia 3-5 nhánh để bám khi cây leo giàn. Su Su có hoa nhỏ, đơn tính, hoa cái đơn độc thường mọc ở nách lá, bầu 1 ô, 1 noãn. Quả thịt hình thuôn dài bầu phía dưới gần giống quả lê. Su Su có cạnh lồi dọc và sần sùi, da quả mỏng, thịt quả dày, trong ruột quả chứa một hạt lớn hình oval dẹp.\n\nNgọn su su là thực phẩm giàu folate, chất xơ, chất đồng, chất kẽm và vitamin B, giúp ngăn chặn sự hình thành của Homocystein là chất có khả năng gây nên bệnh tim và đột quỵ. Vitamin C, K có trong su su giúp chống ô xy hóa, loãng xương.\n\nQuả Su su là loại rau ngon dịu, có thể luộc, xào, hầm thịt, nấu canh, làm nộm, có thể dùng ngâm nước muối làm dưa, thịt quả có thể giã lấy bột (1 kg quả cho khoảng 13g bột mịn, trắng), còn bã dùng làm thức ăn cho gia súc; bột này có thể dùng làm bánh với trứng, sữa và đường. Chồi ngọn của Su su khi còn non cũng dùng làm rau ăn như các loại đậu Côve, có thể xào, hoặc tráng với trứng (cũng giống như măng tây tráng trứng). Các củ hình thành ở rễ các cây trồng 2-3 năm, có củ nặng 200g – 1 kg. Các củ non có thể dùng nấu ăn thay khoai tây.",
    "item_image": "chayote",
    "item_clipart": "chayote_clip"
  },
  {
    "item_id": 10,
    "item_name": "Chilli",
    "item_nameVi": "Ớt",
    "item_nameVi2": "Ot",
    "item_sname": "Capsicum annuum",
    "item_description": "Chili peppers are the fruit of plants from the genus Capsicum, which belongs to the Solanaceae (nightshade) family. The chili plant typically grows to about 30 to 40 centimeters tall, with soft stems and branches, and long, light green leaves. Chili flowers bloom in the spring, and the small, bell-shaped flowers are white with five petals. Chili peppers are widely popular and commonly used in Vietnamese cuisine. Though originally native to the Americas, chilies are now grown worldwide and come in many varieties. In Vietnam, there are four main types of chilies: ớt hiểm (hot chili), ớt ngọt (sweet chili), ớt sừng (horn-shaped chili), and ớt chuông (bell pepper).\n\nAccording to research, scientists have found that chilies are rich in a compound called C9H14O2, known as capsaicin. This compound has beneficial effects on diseases like stomach cancer and prostate cancer. Traditional Eastern medicine records indicate that the spicy and hot properties of chili peppers have numerous health benefits. Capsaicin, in particular, is the main agent responsible for the spiciness, which stimulates the brain to produce endorphins. In addition to its effective pain relief, this substance is also known to help treat cancer risks.\n\nEating chilies along with drinking water to alleviate the spiciness not only burns calories but also increases feelings of fullness, reducing appetite. Moreover, chilies can enhance flavor, making food easier to digest and improving nutrient absorption. As a result, consuming spicy chilies increases brain function and signals the kidneys to release fluids that support bodily movement. This kidney activity helps burn fat more efficiently. Consequently, studies have directed the use of chilies toward weight loss for individuals with excess fat and those at risk of obesity.\n\nChilies are widely used in Vietnamese dishes such as phở, bún bò Huế, mì Quảng, bánh xèo, and many other meals. In addition, chilies are often used as a spice to add a distinctive flavor to dishes. They also have medicinal uses in traditional remedies for treating digestive issues and boosting the immune system.\n\nHowever, eating extremely spicy chilies can cause a burning sensation in the mouth and even result in a temporary loss of taste in the affected areas. Capsaicin in chilies triggers a strong response in sensory cells when it comes into contact with sensitive areas, like the mucous membrane of the mouth. This results in a hot, burning sensation in the mouth and can also irritate the stomach lining. Consuming excessive chilies over time can have negative effects on the stomach, especially for those with conditions such as ulcers. In these cases, eating chilies can aggravate the condition.\n\nSome people may experience intestinal discomfort from eating chilies. Symptoms can include abdominal pain, a burning sensation in the intestines, cramping, and painful diarrhea. This is more common in individuals with irritable bowel syndrome (IBS), and chilies can temporarily worsen symptoms in those not accustomed to consuming them frequently.",
    "item_descriptionVi": "Ớt là một loại quả của cây thuộc chi Capsicum của họ Cà (Solanaceae). Cây ớt cao chỉ độ ba, bốn mươi xăng-ti-mét. Thân và cành ớt mềm, lá thuôn dài, màu xanh nhạt. Ớt ra hoa vào mùa xuân, hoa ớt màu trắng như chiếc chuông nhỏ xíu với năm. Quả Ớt là một loại quả rất phổ biến và được sử dụng rộng rãi trong ẩm thực Việt Nam. Ớt có nguồn gốc từ châu Mỹ, nhưng ngày nay đã được trồng khắp nơi trên thế giới và có nhiều loại khác nhau. Tại Việt Nam, có 4 loại ớt chính: Ớt hiểm, ớt ngọt, ớt sừng và ớt chuông.\n\nTheo nhiều nghiên cứu, các nhà khoa học cho hay ớt có chứa nhiều C9H14O2 dồi dào. Đây là chất được gọi là capsaicin có tác dụng tốt với bệnh như ung thư dạ dày và ung thư tuyến tiền liệt. Theo ghi chép của đông y, vị cay nồng và nóng của ớt có nhiều tác dụng rất tốt cho sức khỏe. Đặc biệt là capsaicin một chất chủ yếu tạo ra vị cay giúp não sản sinh ra hormone endorphin. Chất này ngoài giảm đau hiệu quả còn giúp điều trị các nguy cơ mắc bệnh ung thư.\n\nKhi ăn ớt kết hợp uống nước để giảm độ cay, cơ thể ngoài thiêu đốt calo còn tăng cảm giác no khiến cảm giác thèm ăn mất đi. Hơn nữa ớt cũng giúp khẩu vị cải thiện khiến thức ăn được chuyển hóa và cơ thể hấp thụ tốt hơn. Nhờ vậy mà ăn ớt cay sẽ làm tăng chức năng hoạt động của não bộ khiến cho hệ thần kinh phát tín hiệu đến thận. Khi thận được thông báo sẽ tiết dịch hỗ trợ vận động của cơ thể. Do vậy chất béo nhanh chóng bị dịch thận tiết ra thiêu đốt. Vì vậy mà các nghiên cứu đã hướng ớt đến ứng dụng giảm cân cho đối tượng có nhiều mỡ thừa và nguy cơ béo phì.\n\nỚt được sử dụng rộng rãi trong các món ăn Việt Nam, như món phở, bún bò Huế, mì Quảng, bánh xèo và nhiều món ăn khác. Ngoài ra, ớt còn được dùng để làm gia vị, tạo hương vị đặc biệt cho các món ăn. Ớt cũng có công dụng trong y học dân gian, được dùng để chữa các bệnh liên quan đến đường ruột và tăng cường sức đề kháng cho cơ thể.\n\nĂn ớt quá cay có thể gây bỏng rát ở vùng miệng, bị mất vị giác ở khu vực bị bỏng. Chất capsaicin có trong ớt khi tiếp xúc với các vùng da nhạy cảm như trong niêm mạc miệng sẽ gây ra phản ứng kích thích mạnh lên các tế bào cảm thụ. Ớt gây ra tình trạng cay nóng, bỏng rát ở khoang miệng và nó cũng gây kích ứng niêm mạc dạ dày. Nếu ăn nhiều ớt trong thời gian dài chắc chắn sẽ ảnh hưởng không tốt đến dạ dày. Còn nếu bạn đang bị các vấn đề về dạ dày như viêm loét dạ dày thì tốt nhất không nên ăn ớt, việc ăn ớt sẽ khiến bệnh tình trầm trọng hơn.\n\nĂn ớt có thể gây đau ruột ở một số người. Các triệu chứng có thể bao gồm đau bụng, cảm giác nóng rát trong ruột, chuột rút và tiêu chảy đau đớn. Điều này phổ biến hơn ở những người mắc hội chứng ruột kích thích. Ớt có thể tạm thời làm nặng thêm các triệu chứng ở những người không quen ăn nó thường xuyên.",
    "item_image": "chilli",
    "item_clipart": "chilli_clip"
  },
  {
    "item_id": 11,
    "item_name": "Coriander",
    "item_nameVi": "Rau mùi",
    "item_nameVi2": "Rau mui",
    "item_sname": "Coriandrum sativum",
    "item_description": "Coriander, also known as cilantro or Vietnamese parsley (Coriandrum sativum), has different names depending on the region. It is a herbaceous plant with a taproot, small stem, and typically grows to a height of about 30 to 60 cm. The size of the plant can vary depending on the quality of the soil and the care given by the grower. The fruit of the coriander plant is spherical, green when young, and dark brown when mature, with a strong, pungent odor. This herb has been used as a seasoning for a long time and is believed to have originated in the Mediterranean region. It later spread to many countries, including Vietnam, where it is used in fresh salads or as a seasoning for many familiar dishes.\n\nThe leaves at the base of the plant have long stalks and consist of 1 to 3 leaflets. The leaflets are roundish and divided into three lobes with large, rounded serrations. The leaves higher up on the plant are divided into narrow, needle-like lobes. Coriander flowers are white or slightly pink, forming umbels of 3-5 rays, with no general involucre; the partial involucre consists of 2-3 leaflets attached on one side. As the plant ages, the stems and bark contain more oils (resin). The fruit is a smooth, spherical schizocarp about 2-4 mm in length, consisting of two mericarps, each with four straight ridges and two common ridges shared between them.\n\nCoriander contains a high concentration of essential oils with various components, including fats, proteins, cellulose, non-nitrogenous compounds, omega-3 and omega-6 fatty acids, antioxidants, vitamins (such as A, B1, B2, C), and many other nutrients. The roots, stems, and leaves are used fresh, but they can also be dried for medicinal purposes. The dried fruits are commonly used in folk medicine to treat a range of common ailments.\n\nThe plant has a fragrant aroma and is often cultivated as a culinary herb and spice. In many Mediterranean countries, parts of Central Asia, India, and China, coriander is grown on a large scale for its seeds, which are used in medicine and for extracting essential oils in the perfume industry. Additionally, both the roots and leaves are used medicinally. According to traditional medicine, coriander stimulates digestion, promotes lactation, and is used to help treat measles.",
    "item_descriptionVi": "Rau mùi còn có tên khác là ngò rí, mùi ta. Cách gọi tùy thuộc từng địa phương. Là cây thân cỏ, rễ cọc, thân nhỏ, cao chừng 30 - 60cm. Cây cao lớn hay thấp tùy thuộc chất đất và cách chăm sóc của người trồng. Quả rau mùi có hình cầu, khi non có màu xanh, già có màu nâu đen, mùi hắc và khó ngửi. Đây là loại gia vị được dùng từ rất lâu đời có nguồn gốc từ Địa Trung Hải, về sau được phổ biến ở rất nhiều nước trên thế giới, trong đó có Việt Nam. Chúng được dùng để ăn ghém rau sống hoặc làm gia vị cho nhiều món ăn quen thuộc.\n\nLá ở gốc có cuống dài, có 1 đến 3 lá chét, lá chét hình hơi tròn, xẻ thành 3 thuỳ có khía răng to và tròn; những lá phía trên có lá chét chia thành những thùy hình sợi nhỏ và nhọn. Hoa trắng hay hơi hồng, hợp thành tán gồm 3-5 gọng, không có tổng bao; tiểu bao gồm 2-3 lá chét đính ở một phía. Cây mùi khi già vỏ và thân cây càng nhiều dầu (nhựa). Quả bế đôi hình cầu, nhẵn, dài 2 – 4 mm, gồm hai nửa (phân liệt quả), mỗi nửa có bốn sống thẳng và hai sống chung cho cả hai nửa.\n\nTrong rau mùi có chứa hàm lượng lớn tinh dầu với nhiều thành phần đa dạng: chất béo, chất protein, xenlulozo, chất không nitơ, axit béo omega 3 và omega 6, chất chống oxy hóa, các vitamin (vitamin A, B1, B2, C,…) cùng rất nhiều thành phần khác. Rau mùi được sử dụng cả rễ, thân và lá khi còn tươi. Có thể phơi dùng để làm dược liệu. Quả phơi khô cũng được sử dụng rất phổ biến trong dân gian làm thuốc chữa bộ số bệnh thông thường.\n\nCây có mùi thơm, thường được trồng làm rau thơm và gia vị. Ở nhiều nước vùng ven Địa Trung Hải, một số nước Trung Á, Ấn Độ, Trung Quốc, mùi được trồng quy mô lớn để lấy quả làm thuốc và cất lấy tinh dầu trong công nghiệp làm nước hoa. Ngoài ra, người ta còn dùng cả rễ và lá làm thuốc. Theo dân gian thì mùi kích thích tiêu hoá và lợi sữa, được dùng để làm cho sởi chóng mọc.",
    "item_image": "coriander",
    "item_clipart": "coriander_clip"
  },
  {
    "item_id": 12,
    "item_name": "Cucumber",
    "item_nameVi": "Dưa leo",
    "item_nameVi2": "Dua leo",
    "item_sname": "Cucumis sativus",
    "item_description": "Cucumber, also known as Cucumis sativus, belongs to the gourd family with the scientific classification Cucurbitaceae. In traditional medicine, cucumber is known to have cooling properties, alleviate discomfort, promote urination, soothe sore throats, aid in weight loss, regulate cholesterol levels, and improve skin. Cucumber has been cultivated as an herbal remedy for a long time across the world. Besides its medicinal uses, cucumber is also an essential food in Vietnamese meals.\n\nThe cucumber plant is a crawling vine covered in fine hair. Its stem is angular and has many branches. The leaves are attached to stalks, with the blades divided into 3-5 lobes that are somewhat triangular, and the edges are lined with upright hair. The flowers are monoecious, yellow, and grow 2-3 in the axils of the leaves. The fruit is elongated, cylindrical, and slightly triangular, either smooth or slightly bumpy, measuring 10-36 cm in length. The skin color ranges from green to pale yellow, yellow, or brownish-yellow. The seeds are numerous, ovular, white, tough, and shiny.\n\nCucumbers contain up to 95-97% water, 0.8% protein, 3% carbohydrates, 0.7% cellulose, and 0.5% ash, including 23 mg% calcium, 27 mg% phosphorus, and 1 mg% iron. They also contain vitamin A (carotene) at a concentration of 0.3 mg%, vitamin B1 at 0.03 mg%, B2 at 0.04 mg%, vitamin PP at 0.1 mg%, and vitamin C at 5 mg%. In addition to vitamins A and C, cucumbers are also a significant source of iron, manganese, iodine, and thiamine. Certain varieties of cucumber have a mild fragrance due to the presence of unsaturated aldehyde compounds like (E, Z)-nona-2,6-dienal, and cis- and trans-isomers of 2-nonenal. The slight bitterness of cucumber skin is due to cucurbitacin and colocynthine. Cucumber seeds contain an alkaloid called poxanthine, which has deworming properties.\n\nCucumbers are cooling and promote urination. As a food, they are refreshing and diuretic. Cucumbers are used in food and as medicine in cases of mild fever, abdominal pain from poisoning, gout, arthritis, measles, and E. coli infections. They can also be applied externally to treat itching and fungal skin infections. The roots and leaves are used to reduce swelling and treat poisoning. Cucumber fruit has a sweet taste, is cold in nature, and slightly toxic, so it should not be consumed in large amounts. It has cooling properties, helps alleviate discomfort, and promotes urination. The leaves of the cucumber plant are bitter, neutral in nature, and slightly toxic. When crushed and juiced, the liquid can induce vomiting to expel toxins.",
    "item_descriptionVi": "Dưa leo hay còn được gọi là dưa chuột thuộc họ Bầu bí với danh pháp khoa học là Cucurbitaceae. Trong y học, Dưa leo có tác dụng giúp thanh nhiệt, giải phiền, lợi thủy đạo, giảm viêm họng, đau rát cổ họng, giúp giảm cân, điều hòa mức cholesterol, làm đẹp da. Dưa leo là một loại thảo dược được trồng lâu đời trên thế giới. Ngoài công dụng dùng làm thuốc, dưa leo còn là một loại thực phẩm không thể thiếu trong bữa ăn của người Việt.\n\nCây mọc bò, toàn thân có lông. Thân có nhiều cành, có góc. Lá mang cuống, phiến có từ 3-5 thuỳ hình hơi ba cạnh, mép có lông đứng. hoa đơn thính, màu vàng, mọc 2-3 ở nách lá. Quả hình thuôn dài, hìh trụ hai hơi ba cạnh, nhẵn hoặc hơi có bướu nhỏ, có thể dài 10-36cm, màu lục hay lục vàng nhạt, vàng hay vàng nâu. Hạt nhiều, hình trứng, trắng, dai, bóng.\n\nDưa chuột chứa tới 95 - 97% nước, 0,8% protit, 3% gluxit, 0,7% xenlulozo, 0,5% tro, trong đó 23 mg% canxi, 27mg%P, 1mg% Fe. Dưa chuột còn chứa vitamin A (caroten) với tỷ lệ 0,3mg%, vitamin B1 0,03mg%, B2 với tỷ lệ 0,04mg%, vitamin PP 0,1mg% và Vitamin C 5mg%. Ngoài viatamin A và C, trong dưa chuột còn chứa một lượng quan trọng sắt, mangan, iot và thiamin. Một số loại dưa chuột có thể có vị nhẹ thơm vì chứa một phần aldehyde không bão hòa, chẳng hạn như (E, Z) -nona-2,6-dienal, và cis - và xuyên - đồng phân của 2 nonenal. Vỏ dưa chuột có vị hơi đắng là do cucurbitacin, colocynthine. Hạt dưa chuột chứa một akaloid gọi là poxanthine có tác dụng trừ giun.\n\nQuả dưa chuột có tác dụng thanh nhiệt, giải phiền, lợi thủy đạo. Về mặt thức ăn, dưa chuột là món ăn mát và lợi tiểu. Quả dùng làm thực phẩm, làm thuốc trong các trường hợp sốt nhẹ, nhiễm độc đau bụng, thống phong, tạng khớp, bệnh sởi và nhiễm trực khuẩn coli. Dùng ngoài để trị ngứa, nấm ngoài da. Rễ và lá cũng được sử dụng trị sưng đau, chữa ngộ độc. Quả dưa chuột có vị ngọt, tính hàn hơi có độc không nên dùng nhiều có tác dụng thanh nhiệt, giải phiền, lợi thủy đạo (tiêu nước). Lá dưa chuột vị đắng, tính bình, hơi có độc, giã nát vắt lấy nước uống vào nôn ra.",
    "item_image": "cucumber",
    "item_clipart": "cucumber_clip"
  },
  {
    "item_id": 13,
    "item_name": "Eggplant",
    "item_nameVi": "Cà tím",
    "item_nameVi2": "Ca tim",
    "item_sname": "Solanum melongena",
    "item_description": "Eggplant is closely related to many other plants like tomatoes, small eggplants (Solanum torvum), round eggplants (Solanum macrocarpon), and even potatoes. Of course, this plant did not originate in Vietnam; it hails from southern India and Sri Lanka, as well as China, where it has been cultivated for thousands of years. The Moors in Spain introduced eggplant to southern and eastern Europe, where it became very popular.\n\nEggplant is an annual plant, growing up to 40–150 cm (16–57 inches) tall, typically with spines, and has large, coarsely lobed leaves measuring 10–20 cm long and 5–10 cm wide. The flowers can be white or purple, featuring a five-lobed corolla and yellow stamens. The fruit is a fleshy berry, typically less than 3 cm in diameter in wild varieties, but much larger in cultivated forms. The fruit contains many small, soft seeds. Wild varieties can grow larger, reaching up to 225 cm (84 inches) tall with leaves over 30 cm long and 15 cm wide.\n\nThe flower clusters grow in the leaf axils. The flowers can be white, bluish, or light purple. The calyx is funnel-shaped with five to nine unequal lobes, shaped like a lance. The corolla is star-shaped with an irregular number of petals. The number of stamens equals the number of petals, with short filaments. Additionally, the anthers are arranged in a circle around the stigma, opening at the top of a round or slightly flattened ovary with several chambers. The berry's size and color depend on the variety. Commonly, the fruit has a purple skin, is cylindrical, and the top is more swollen. Inside, it is smooth and contains edible soft seeds.\n\nEggplant is a nutrient-rich food that contains fiber, vitamins, and minerals, which can benefit overall health. Although referred to as a vegetable, technically it is a fruit since it develops from flowers and contains seeds. Eggplants come in various sizes and colors; while the deep purple variety is popular, they can also be red, green, or even black. In addition to adding unique texture and mild flavor to dishes, eggplant offers numerous potential health benefits.\n\nEggplant is often eaten raw, sliced or julienned, and served with sauces or dips. It can be prepared in many simple ways, such as boiling, steaming, grilling, sautéing, or stewing with meat or fish, resulting in delicious dishes. In many countries, eggplant is used to create famous and intricate recipes like Ratatouille in France, fried in dishes like Parmigiana di Melanzane in Italy, or steamed with fillings in China. Additionally, eggplant is used in traditional medicine for its sweet taste and cooling properties, helping to relieve heat, promote blood circulation, and regulate digestion. Eggplant juice can be used to treat boils, ulcers, reduce fat, and alleviate constipation. The eggplant plant is also grown in home gardens to enrich vegetable plots and enhance the garden landscape.",
    "item_descriptionVi": "Cây cà tím có cùng quan hệ và họ hàng rất gần gũi với nhiều cây khác như cà chua, cà pháo, cà bát, cà dừa thậm chí là cả khoai tây. Tất nhiên, đây không phải là cây xuất phát ở Việt Nam, chúng có nguồn gốc từ miền Nam của Ấn Độ và bên Sri Lanka, ở cả bên Trung Quốc và được trồng ở đó từ rất lâu hàng ngàn năm về trước. Người Moor ở Tây Ban Nha đã đưa cà tím vào Nam và Đông Âu, nơi nó trở nên rất phổ biến.\n\nCà tím là cây một năm, cao tới 40 – 150 cm (16 - 57 inch), thông thường có gai, với các lá lớn có thùy thô, dài từ 10–20 cm và rộng 5–10 cm. Hoa màu trắng hay tía, với tràng hoa năm thùy và các nhị hoa màu vàng. Quả cà tím là loại quả mọng nhiều cùi thịt, đường kính nhỏ hơn 3 cm ở cây mọc hoang dại, nhưng lớn hơn rất nhiều ở các giống trồng. Quả chứa nhiều hạt nhỏ và mềm. Các giống hoang dại có thể lớn hơn, cao tới 225 cm (84 inch) và lá to (dài tới trên 30 cm và rộng trên 15 cm).\n\nCụm hoa mọc ở kẽ lá thành xim. Hoa màu trắng, tím xanh, tím nhạt… Đài hình phễu có năm đến chín thùy, không bằng nhau, hình mũi mác. Có tràng hình bánh xe với số cánh hoa không đều và không cố định. Số lượng nhị bằng số cánh hoa, gồm phần chỉ nhị ngắn. Ngoài ra, còn có bao phấn xếp thành vòng quanh nhụy, mở ở đầu đính kèm bầu hình cầu hoặc hơi dẹt, có nhiều ô. Quả mọng, có kích thước và màu sắc tùy theo giống. Thường gặp vỏ quả màu tím, thân hình trụ dài, phần đầu phình to hơn. Bên trong, trơn mượt, có các hạt mềm, có thể ăn được.\n\nCà tím là một loại thực phẩm giàu chất dinh dưỡng có chứa chất xơ, vitamin, khoáng chất. Chúng có thể có lợi cho sức khỏe tổng thể. Cà tím có họ là thực vặn và được sử dụng trong nhiều món ăn khác nhau trên khắp trên thế giới. Mặc dù, cà tím được gọi làm một loại rau, nhưng về mặt kỹ thuật, chúng là một loại trái cây vì cơ bản chúng phát triển mà có cả hoa và chứa hạt. Cây cà tím có nhiều loại kích thước và màu sắc khác nhau. Và mặc dù cà tím có vỏ màu tím đậm là phổ biển nhưng chúng có thể có màu đỏ, xanh lá cây hoặc thậm chí là màu đen. Ngoài việc mang lại kết cấu độc đáo và hương vị nhẹ nhàng cho các công thức nấu ăn, cà tím còn mang lại rất nhiều lợi ích tiềm năng cho sức khỏe.\n\nCà tím được dùng làm rau ăn sống với dạng xẻ dọc hoặc cắt lát chấm với mắm, cá kho,… Dùng chế biến các món ăn đơn giản như luộc, hấp cơm, nướng, xào, nấu canh, kho với thịt, cá,… vô cùng đơn giản nhưng lại rất ngon miệng. Ở nhiều nước, quả cà tím được dùng để chế biến các món ăn nổi tiếng và khá công phu như Ratatouille của Pháp, dùng chiên như trong món parmigiana di melanzane ở Ý, dồn nhân thịt hấp cách thủy ở Trung Quốc,…Quả cà tím còn được dùng làm thuốc với vị ngọt, tính mát giúp giải nhiệt, hoạt huyết, điều hòa tiêu hóa. Dùng  cà tím nấu lấy nước uống chữa ung nhọt, lở loét, giảm mỡ, chữa táo bón,… Cây cà tím được trồng trong sân vườn làm phong phú hơn cho vườn rau tại nhà, làm xanh mát cảnh quan sân vườn.",
    "item_image": "eggplant",
    "item_clipart": "eggplant_clip"
  },
  {
    "item_id": 14,
    "item_name": "Fish Mint",
    "item_nameVi": "Rau diếp cá",
    "item_nameVi2": "Rau diep ca",
    "item_sname": "Houttuynia cordata",
    "item_description": "Fish mint, scientifically known as Houttuynia cordata, belongs to the Saururaceae family and is native to countries in southern China, Southeast Asia, Japan, and South Korea. Currently, it is distributed throughout Asia.\n\nFish mint is an herbaceous plant that grows year-round, reaching heights of 0.6 to 1 meter, with stems that are green or reddish-purple. It typically grows in moist environments such as riverbanks, forests, rice paddies, ditches, and areas close to sea level and lakes. The leaves are heart-shaped, up to 75 mm long, with slightly pointed tips. When crushed or chewed, they emit a fishy odor. The flowers are small, growing in clusters and are yellowish-green, typically blooming from April to June. The capsule fruit contains oval, smooth seeds and usually ripens from July to October. The flower clusters grow at the tips of the stems, forming spikes 2 to 2.5 cm long, with many small pale yellow flowers and four white bracts resembling petals, and three stamens without anthers.\n\nThe entire fish mint plant contains essential oils. The main components include non-antibacterial substances, aldehyde functional groups, and ketone derivatives such as 1-decanal, 1-dodecanal, and methyl-n-nonyl ketone. The antibacterial compound is 3-oxododecanal. The terpenes present include pinene, limonene, camphene, bornyl acetate, linalool, geraniol, myrcene, and caryophyllene. Additionally, fish mint essential oil contains caprylic acid, capric aldehyde, oleic acid, chlorogenic acid, stearic acid, lipids, and vitamin K. Other compounds isolated from fish mint leaves include cordalin, 3-sitosterol, and various flavonoids (quercitrin, hyperin, isoquercitrin, rutin, and afzelin).\n\nFish mint is commonly consumed raw with meats, fish, or seafood, or it can be cooked. Many people also crush it to extract the juice for drinking and use the pulp as a poultice.\n\nFish mint is known for its many health benefits. However, it may not be entirely beneficial in specific cases. Some users have concerns about its effects, such as whether it can treat leucorrhea. Generally, fish mint has cooling properties. As a food, it is often combined with other herbs like Vietnamese balm, Thai basil, lettuce, perilla, and green onions. Combining these herbs can provide significant health benefits, and it is rare to experience adverse effects from consuming fish mint. However, as with any herb, excessive consumption can lead to negative health impacts.",
    "item_descriptionVi": "Diếp cá có tên khoa học là Houttuynia cordata, thuộc họ Saururaceae và có nguồn gốc từ các nước thuộc khu vực miền Nam Trung Quốc, Đông Nam Á, Nhật Bản và Hàn Quốc. Hiện tại, cây diếp cá được phân bổ khắp các lục địa châu Á. \n\nDiếp cá là cây thân thảo, mọc quanh năm với chiều cao phát triển từ 0.6 - 1m đồng thời có thân màu lục hoặc tím đỏ. Cây thường mọc ở những nơi ẩm ướt như ven suối, ven rừng, lề ruộng, bờ mương, khe núi và những khu vực gần mực nước biển, hồ. Lá hình tim, dài tới 75mm và phần đầu lá hơi nhọn. Khi vò hoặc nhai thử sẽ ngửi thấy mùi tanh như mùi cá. Hoa diếp cá nhỏ, mọc thành chùm và có màu vàng lục, thường ra hoa từ tháng 4 - 6. Quả nang với hạt hình trái xoan, nhẵn và thường ra quả từ tháng 7 - 10. Cụm hoa mọc ở ngọn thân thành bông dài 2 - 2,5cm, mang nhiều hoa nhỏ màu vàng nhạt, tổng bao gồm 4 lá bắc màu trắng giống cánh hoa, hoa nhị 3 và không có bao.\n\nToàn thân cây Diếp cá chứa tinh dầu. Thành phần chủ yếu bao gồm chất không có tác dụng kháng khuẩn, nhóm chức aldehyd và các dẫn xuất ceton như 1-decanal, 1-dodecanal, methyl-n-nonyl ceton. Chất có tác dụng kháng khuẩn: 3-oxododecanal.Nhóm terpen: Pinen, limonen, camphen, bornyl acetat, linalol, geraniol, myrcen và caryophylen. Trong tinh dầu Diếp cá còn chứa acid caprinic, aldehyde capric, acid coleic, acid clorogenic, acid stearic, lipid, vitamin K… Một số chất khác cũng được phân lập từ lá Diếp cá như cordalin, 3 – sitosterol và các flavonoid (quercitrin, hyperin, isoquercitrin, rutin và afzelin).\n\nDiếp cá thường được dùng bằng cách ăn sống trực tiếp cùng với các loại thịt, cá, hải sản hoặc nấu chín. Bên cạnh đó, nhiều người còn giã nát, lấy phần nước để uống và phần bã để đắp.\n\nRau diếp được chứng minh có nhiều lợi ích cho sức khỏe. Tuy nhiên, nó không hẳn hoàn toàn tốt trong một số trường hợp cụ thể. Nhiều người sử dụng cũng thường có mối quan tâm tới loại rau này chẳng hạn như: ăn rau diếp cá có trị huyết trắng không?... Về cơ bản, rau diếp cá có đặc tính hàn. Với vai trò là thực phẩm, rau diếp cá được sử dụng kết hợp cùng với các loại rau thơm khác như rau kinh giới, rau húng lủi, rau xà lách, rau tía tô, hành lá... Việc sử dụng kết hợp các loại rau cùng một lúc mang lại khá nhiều lợi ích cho sức khỏe. Và điều này cũng có thấy sử dụng rau diếp cá rất ít khi gặp tác dụng phụ do nó gây nên. Tuy nhiên, cũng như những loại rau khác, nếu sử dụng rau diếp cá với số lượng lớn hay lạm dụng sử dụng loại rau này có thể gây ra một số ảnh hưởng không có lợi tới sức khoẻ.",
    "item_image": "fish_mint",
    "item_clipart": "fish_mint_clip"
  },
  {
    "item_id": 15,
    "item_name": "Garlic",
    "item_nameVi": "Tỏi",
    "item_nameVi2": "Toi",
    "item_sname": "Allium sativum",
    "item_description": "Garlic is an annual herbaceous plant that grows to a height of 30 to 40 cm. The bulb is short and shaped like a pyramid, composed of several smaller bulbs called cloves, which vary in size and are tightly packed around a central stalk. The outer skin of the bulb is thin and can be white or slightly pink. The leaves are flat, narrow, elongated, and thin. The leaf sheaths are large and long with a longitudinal groove, tapering to a sharp point, and have parallel veins on both sides. The flower cluster forms a round head at the tip, surrounded by long, pointed bracts. The flowers are white or pink with long, thread-like stalks. Each flower consists of six lanceolate petals arranged in two rows, which are elongated. There are six stamens, with long filaments attached to the petal segments; the ovary is globular. The fruit is a capsule. The flowering and fruiting season is from August to November.\n\nThe part of garlic commonly referred to as the \"bulb\" is actually a cluster of storage leaves that contains about 8 to 20 cloves. Surrounding the bulb are 2 to 5 layers of thin, white, scale-like leaves formed from the previous leaf sheaths, attached to a flattened, spherical base, which is the actual stem of the garlic. The cloves are oval-shaped, with three to four sides, pointed at the top and flat at the base. Each clove is covered with layers of white scales and a pinkish-white epidermis that is easy to peel away from the solid inner part. The cloves are arranged in layers around a long stalk with a diameter of 1 to 3 mm that grows from the center of the base. The solid inner part of the cloves contains a lot of water, a fragrant smell, a pungent taste, and is durable.\n\nGarlic is very rich in nutrients. According to research, 100 grams of garlic contains 6.36 grams of protein, 33 grams of carbohydrates, 150 calories, and nutrients such as B vitamins (B1, B2, B3, B6), iron, calcium, potassium, manganese, magnesium, phosphorus, etc. The main active compounds in garlic are organic sulfur compounds and glycosides. Additionally, garlic has a high content of germanium and selenium. Notably, the germanium content in garlic is higher than in herbal medicines such as ginseng, green tea, and red tea. The basic effects of garlic mainly come from allicin. Fresh garlic does not contain free allicin; it only has its precursor, alliin. When garlic is chopped, the enzymes within it are activated, stimulating alliin to form allicin.\n\nGarlic is not only an essential seasoning in the kitchen that enhances the flavor of dishes but also has numerous benefits in preventing and treating cardiovascular diseases, cancer, infections, and musculoskeletal disorders.",
    "item_descriptionVi": "Tỏi là cây thân thảo sống hàng năm, cao 30 – 40 cm. Thân hành ngắn, hình tháp gồm nhiều hành con gọi là ánh tỏi, to nhỏ không đều, xếp ép vào nhau quanh mỗi trục lõi. Vỏ ngoài của thân hành mỏng, màu trắng hoặc hơi hồng. Lá phẳng và hẹp, hình dài, mỏng. Bẹ lá to và dài có rãnh dọc, đầu nhọn hoắt, gân song song, hai mặt nhẵn. Cụm hoa mọc ở ngọn thành đầu tròn, bao bọc bởi những lá mo có mũi nhọn rất dài. Hoa màu trắng hay hồng có cuống hình sợi dài. Hoa bao gồm 6 phiến hình mũi mác, xếp thành hai hàng, thuôn. Nhị 6, chỉ nhị có cựa dài, đính vào các mảnh bao hoa; bầu gân hình cầu. Quả nang. Mùa hoa quả: tháng 8 – 11.\n\nBộ phận được dùng của tỏi mà thường hay gọi là củ Tỏi, thật ra là phần thân hành gồm tập hợp các lá dự trữ, chứa khoảng 8 đến 20 hành con. Bao xung quanh củ gồm 2 đến 5 lớp lá vẩy trắng mỏng, do các bẹ lá trước tạo thành, gắn vào một đế hình cầu dẹt – là phần thân thực sự của Tỏi. Các hành con hình trứng. 3 mặt đến 4 mặt, đỉnh nhọn, đế cụt. Mỗi hành con được phủ những lớp lá vẩy trắng và một lớp biểu bì màu trắng hồng dễ tách khỏi phần rắn bên trong. Các hành con xếp thành lớp quanh một sợi dài, đường kính 1 mm đến 3 mm mọc từ giữa đế. Phần rắn bên trong của các hành con chứa nhiều nước, mùi thơm, vị hăng và bền.\n\nTỏi rất giàu chất dinh dưỡng. Theo nghiên cứu, trong 100g tỏi có chứa 6,36g protein, 33g carbohydrates, 150g calo và các dưỡng chất như vitamin nhóm B (B1, B2, B3, B6), sắt, canxi, kali, mangan, magie, photpho,... Thành phần công hiệu chính trong tỏi là hợp chất hữu cơ sulfur và glycosides. Ngoài ra, trong tỏi còn có hàm lượng cao germanium và selen. Đặc biệt, hàm lượng germanium trong tỏi cao hơn so với các dược liệu như nhân sâm, trà xanh, trà đỏ,... Tác dụng cơ bản của tỏi chủ yếu đến từ allicin. Trong tỏi tươi không có allicin tự do, chỉ có tiền chất của nó là alliin. Khi tỏi được băm nhuyễn, enzyme trong tỏi bị kích hoạt sẽ kích thích alliin hình thành allicin.\n\nTỏi không chỉ là loại gia vị thiết yếu trong nhà bếp, giúp làm tăng hương vị cho món ăn mà còn có nhiều tác dụng trong việc phòng, điều trị bệnh tim mạch, ung thư, nhiễm trùng, xương khớp.",
    "item_image": "garlic",
    "item_clipart": "garlic_clip"
  },
  {
    "item_id": 16,
    "item_name": "Green Beans",
    "item_nameVi": "Đậu cove",
    "item_nameVi2": "Dau cove",
    "item_sname": "Phaseolus vulgaris",
    "item_description": "Green beans, also known as đậu cove or đậu que in Vietnam, belong to the legume family and have the scientific name Phaseolus vulgaris. They originate from Central America. In Vietnam, green beans are commonly grown throughout the country, from North to South, due to their ease of cultivation and suitability for the tropical climate. Green beans are herbaceous plants, and they come in two varieties: bush beans (shorter) and pole beans (climbing). Depending on the variety, the harvest time varies, typically between 40 to 70 days after planting. Green beans are long, flat pods that can be green, yellow, or purple, with many seeds inside.\n\nThe pods are elongated, pointed at the ends, with smooth skin, and usually measure around 8-20 cm in length. The root system is underdeveloped, with a short main root and shallow lateral roots, spreading within 20-30 cm below the surface and within a radius of less than 100 cm. The seeds can be kidney-shaped, oval, or egg-shaped depending on the variety. The beans have a tough string along the pod that is usually removed before cooking.\n\nYoung green bean pods contain about 2.5% protein, 0.2% fat, 7% carbohydrates, and are particularly rich in vitamins A, C, and minerals. Green beans are high in protein, fiber, vitamins, and iron. A bowl of cooked green beans provides 19.1g of fiber, and the soluble fiber helps reduce cholesterol. Green beans are also low in fat (1.13g) and contain no cholesterol, making them a great choice for children on a restricted diet. A bowl of green beans supplies 15g of protein, containing all essential amino acids except taurine. When combined with rice or corn, they form a complete protein source for the body. Green beans also contain nearly all the B vitamins. One cup provides 64% of the body's folate needs and more than 30% of its thiamin requirement. Folate is essential for protein metabolism and can help prevent certain types of anemia, while thiamin is important for the metabolism of carbohydrates and proteins.\n\nGreen beans have a mild flavor and can be combined with various ingredients to make delicious dishes such as stir-fried green beans with minced meat, stir-fried green beans with shrimp, green bean stew with tofu, or simply boiled green beans.",
    "item_descriptionVi": "Đậu cove là cây thuộc họ đậu, đậu que có tên khoa học là Phaseolus vulgaris, có nguồn gốc từ khu vực Trung Mỹ. Tại Việt Nam, đậu que được gọi bằng đậu cove hay đậu que. Nhờ đặc tính dễ trồng, thích hợp với khí hậu nhiệt đới nên đậu que được trồng phổ biến từ Bắc vào Nam ở nước ta. Đậu que là cây thân thảo, được chia thành hai loại: đậu que lùn và đậu que leo. Tùy vào từng giống, thời gian thu hoạch quả sẽ khác nhau, thường khoảng 40 - 70 ngày sau khi gieo trồng. Quả đậu que dài, dẹt có màu xanh, vàng hoặc tím, bên trong có nhiều hạt.\n\nThuôn dài, đầu nhọn, vỏ láng mịn, chiều dài khoảng 8 - 20cm. Rễ kém phát triển, rễ chính ngắn, rễ phụ cắm nông, phân bố cách mặt đất khoảng 20 - 30cm, trong phạm vi bán kính dưới 100 cm. Hạt có các dạng hạt hình thận, hình trứng, hình bầu dục tùy theo giống. Đường chỉ dai và cứng. Thường được tước kỹ trước khi chế biến món ăn.\n\nQuả đậu cove non chứa khoảng 2,5% đạm, 0,2% chất béo, 7% chất đường bột và đặc biệt nhiều vitamin A, C, chất khoáng. Đậu cove giàu protein, chất xơ, vitamin, sắt. Một bát đậu cove nấu chín có chứa 19,1g chất xơ, chất xơ hòa tan giúp giảm cholesterol. Đậu cove cũng ít chất béo (1,13g) và không chứa cholesterol, là sự lựa chọn tuyệt vời cho trẻ cần ăn kiêng. Một bát đậu cove cung cấp 15g protein, tạo thành từ tất cả các axit amin thiết yếu, trừ taurine. Nó kết hợp với gạo hoặc ngô để tạo thành nguồn protein hoàn chỉnh cung cấp cho cơ thể. Đậu cove còn chứa gần như tất cả các vitamin nhóm B. Một chén cung cấp 64% nhu cầu folate và hơn 30% thiamin cơ thể cần một thán olate được sử dụng cho sự chuyển hóa của protein và có thể ngân nga một số loại bệnh thiếu máu. Thiamin quan trọng cho cả qua nh chuyển hóa cacbonhydrat và protein...\n\nĐậu cove có vị dễ ăn và có thể kết hợp với nhiều nguyên liệu khác để chế biến thành món ngon như đậu que xào thịt bằm, đậu que xào tôm, đậu que hầm đậu hũ, đậu que luộc,...",
    "item_image": "green_beans",
    "item_clipart": "green_beans_clip"
  },
  {
    "item_id": 17,
    "item_name": "Green Onion",
    "item_nameVi": "Hành lá",
    "item_nameVi2": "Hanh la",
    "item_sname": "Allium fistulosum",
    "item_description": "Green onion, also known as scallions, has the scientific name Allium fistulosum. It is a popular herb in Vietnamese cuisine and many other Asian countries. Green onions typically grow to a height of 30 to 60 cm, with slender, vibrant green stems and long, flat, dark green leaves.\n\nThis herbaceous plant is perennial and has a distinct aroma. Each plant usually has 5-6 leaves that are hollow, with a bulbous base and a tapered tip. The flowers grow on a hollow, tubular stalk and are clustered together. The fruit is a round capsule. The roots of the green onion are bulbous, elongated, slightly asymmetrical, with a healthy white root cluster growing in loose, well-drained soil.\n\nGreen onions not only add a delicious flavor to dishes but are also rich in nutrients. They are high in vitamins A, C, and K, along with minerals such as iron, calcium, and manganese. Green onions contain beneficial organic compounds that help boost the immune system and have anti-inflammatory properties.\n\nGreen onions are considered a common spice used worldwide, including in Vietnam. They are typically used as a finishing touch in various dishes like soups, stir-fries, and porridge. Their distinctive aroma is beloved by many, especially when sautéed in oil, enhancing the visual appeal and flavor of meals. Though they are just a seasoning, green onions also offer numerous health benefits. They have a spicy taste and pungent smell, with warming properties. They can help warm the stomach and spleen, expel phlegm, reduce coughs, induce sweating, promote urination, disinfect, detoxify, and reduce inflammation.",
    "item_descriptionVi": "Hành lá, hay còn gọi là hành tây xanh, có tên khoa học là Allium fistulosum. Đây là một loại rau gia vị phổ biến trong ẩm thực Việt Nam và nhiều nước châu Á. Hành lá thường cao từ 30 đến 60 cm, có thân mảnh, xanh tươi và lá dài, dẹt, màu xanh đậm.\n\nHành thân thảo, cây sống lâu năm, có mùi đặc biệt. Một cây có 5-6 lá, lá hình trụ rỗng, phía gốc lá phình to, trên đầu thuôn nhọn.Hoa tự mọc trên ống hình trụ, rỗng, có dạng hình cầu. Gồm nhiều hoa có cuống ngắn; Quả nang, tròn. Rể cây hành lá hình bóng đèn, ít phù, kéo dài, hơi bất đối xứng, phía dưới có chùm rể màu trắng, mọc khỏe trên đất tơi, xốp.\n\nHành lá không chỉ mang lại hương vị thơm ngon cho món ăn mà còn chứa nhiều chất dinh dưỡng. Nó giàu vitamin A, C và K, cùng với các khoáng chất như sắt, canxi và mangan. Hành lá cũng chứa các hợp chất hữu cơ có lợi, giúp tăng cường hệ miễn dịch và có tác dụng chống viêm.\n\nHành lá được xem là một cây gia vị thông dụng mà bất kì nước nào trên thế giới cũng dùng, kể cả Việt Nam. Cây được dùng như gia vị cuối cùng trong các món ăn của nước ta như canh, đồ xào, cháo,… Cây hành lá phổ biến trong hầu hết các món ăn thường ngày đến các món cầu kì. Với mùi thơm đặc trưng riêng của hành được nhiều người ưa chuộng, đặc biệt là khi hành được phi thơm qua với dầu ăn, sẽ giúp món ăn trở nên bắt mắt và thơm ngon hơn nhiều. Dù chỉ là gia vị nhưng hành lá lại mang đến nhiều công dụng chữa bệnh. Hành lá có vị cay, mùi hăng nồng, tính ấm. Có tác dụng ôn ấm tỳ vị, tiêu đờm, giảm ho, làm ra mồ hôi (phát hãn), lợi tiểu, sát khuẩn, giải độc, tiêu viêm.",
    "item_image": "green_onion",
    "item_clipart": "green_onion_clip"
  },
  {
    "item_id": 18,
    "item_name": "Lettuce",
    "item_nameVi": "Xà lách",
    "item_nameVi2": "Xa lach",
    "item_sname": "Lactuca sativa",
    "item_description": "Lettuce, also known as water lettuce or water cabbage, is a herbaceous vegetable native to Europe. Today, it has been crossbred into various varieties and is grown worldwide. Lettuce thrives in cool climates, and in Vietnam, regions with mild climates such as Da Lat grow many types of lettuce that are sweet and have crisp, delicious leaves.\n\nCalories are an energy metric that those who want to build a scientific diet are concerned with. Lettuce is known to be a low-energy vegetable, containing only 15 calories per 100 grams. Therefore, it is a great choice for weight-loss lettuce salads. Most green vegetables are rich in vitamins, but not all of them provide sufficient amounts. In 100 grams of lettuce, the body receives twice the amount of vitamin A required daily. Additionally, beta carotene is also supplied in amounts sufficient for the body’s daily needs. Bone cells and growth activities require vitamin K for support, which also helps protect neurons from damage. This protection reduces the risk of Alzheimer's disease, and for those already suffering from the disease, vitamin K can improve and prolong life. Vitamin C is essential for boosting health and recovery after illness. Adequate vitamin C intake reduces the risk of infections and bacterial invasions caused by poor immunity.\n\nThe body's enzyme metabolism, responsible for synthesizing DNA protein chains, requires folate. For fetal development, folate plays a crucial role in preventing neural tube defects during the first trimester. Folate is also recommended to support brain development and the intelligence of the baby.\n\nEvery 100 grams of lettuce contains 1.73 micrograms of zeaxanthin and an organic pigment called carotenoid. These play an important role in the daily diet, as they are absorbed into the yellow spots of the retina. This helps better protect the retina from UV damage and provides antioxidants that prevent free radical destruction. Lettuce is rich in iron, potassium, magnesium, and copper. Potassium, in particular, influences the body’s cells and fluids, and adequate potassium intake helps regulate heartbeat and stabilize blood pressure. In addition to iron, copper plays a vital role in the production and formation of red blood cells.\n\nOur body functions cyclically, always requiring balanced nutrition to prevent the risk of certain serious diseases. Choosing to eat lettuce regularly brings many positive benefits to the body. Daily consumption of lettuce strengthens bones. People suffering from macular degeneration, anemia, or heart disease should eat lettuce frequently to reduce the severity of these conditions.\n\nLettuce can be used in cooked dishes or dipped in hot pot according to personal preference. Some diets incorporate lettuce in fresh spring rolls or vegetable salads. Typically, we tend to eat lettuce raw, so it's important to choose lettuce with a reliable source and wash it with saltwater before consumption to avoid food poisoning caused by bacteria on the vegetables.",
    "item_descriptionVi": "Xà lách được biết đến là cải bèo, cải tai bèo, là một loại rau thân thảo có nguồn gốc từ châu Âu. Hiện nay, xà lách đã được lai tạo thành nhiều giống khác nhau và được trồng ở khắp mọi nơi trên thế giới. Xà lách ưa khí hậu mát lạnh, tại Việt Nam, những vùng có khí hậu mát mẻ như Đà Lạt,... trồng được nhiều loại xà lách có vị ngọt, lá giòn rất ngon.\n\nCalo là một chỉ số năng lượng mà những ai muốn xây dựng khẩu phần ăn khoa học đều quan tâm. Rau xà lách được biết đến là một loại rau chứa năng lượng thấp chỉ 15 calo/ 100 g. Do vậy đây là sự lựa chọn tốt cho các món salad xà lách giảm cân tuyệt vời. Hầu hết rau xanh sẽ chứa rất nhiều vitamin cung cấp cho cơ thể nhưng đủ thì không phải tất cả đều có thể. Trong 100 g rau xà lách khi ăn, cơ thể sẽ được cung cấp vitamin A gấp 2 lần nhu cầu vitamin mà cơ thể cần. Ngoài ra, beta carotene cũng được cung cấp đủ với nhu cầu hàng ngày của cơ thể. Các tế bào xương và hoạt động phát triển tái tạo đều cần được hỗ trợ từ vitamin K. Ngoài ra đây là một chất giúp bảo vệ các nơ ron thần kinh khỏi sự tổn thương. Nhờ sự bảo vệ từng rơ ron, nguy cơ mắc bệnh alzheimer cũng giảm và nếu đã mắc chứng bệnh nan y này thì vitamin K sẽ cải thiện và kéo dài thời gian. Vitamin C là vitamin giúp nâng cao sức khỏe và phục hồi cho người sau ốm dậy. Khi cơ thể được nạp đầy đủ vitamin C sẽ đẩy lùi nguy cơ mắc các bệnh như viêm nhiễm, vi khuẩn xâm nhập do sức đề kháng kém.\n\nQuá trình chuyển hóa enzym của cơ thể nhằm tổng hợp lên chuỗi protein DNA là nhờ sự tham gia của folate. Đối với sự phát triển của thai nhi đây là một phần quan trong giúp em bé không bị dị tật ống thần kinh trong quá trình phát triển ở 3 tháng đầu thai kỳ. Hơn nữa acid folic cũng được khuyên là nên cung cấp để bổ sung dưỡng chất cho sự phát triển não bộ và trí thông minh của bé.\n\nCứ 100 g rau xà lách thì có thể cung cấp 1,73 mirco gam zeaxanthin và một sắc tố hữu cơ tên là carotenoid. Chúng có vai trò quan trọng trong khẩu phần ăn hàng ngày vì khi cơ thể hấp thụ sẽ thấm thấu lên những điểm màu vàng của võng mạc. Nhờ đó võng mạc được bảo vệ tốt hơn khỏi nguy hiểm từ tia UV và cung cấp các chất chống oxy hóa ngăn ngừa sự phá hủy các gốc tự do. Rau xà lách chứa rất lượng sắt, kali, magie, đồng dồi dào cho cơ thể. Đặc biệt là kali, nguyên tố có sức ảnh hưởng đến tế bào và dịch của cơ thể khi được bổ sung đầy đủ sẽ hạn chế các chứng rối loạn nhịp tim và điều hòa huyết áp ổn định. Không chỉ sắt mà đồng cũng tham gia và có vai trò quan trọng trong quá trình sản xuất hồng cầu và hình thành hồng cầu.\n\nCơ thể chúng ta là bộ máy hoạt động tuần hoàn luôn cần được cân đối dinh dưỡng để tránh khỏi nguy cơ mắc một số bệnh nguy hiểm. Lựa chọn ăn rau xà lách cũng vậy, vì loại rau này mang lại cho cơ thể nhiều lợi ích tích cực. Hàng ngày khi sử dụng rau xà lách, xương trở nên chắc khỏe hơn. Với người bị thoái hóa võng mạc, thiếu máu hay mắc bệnh tim mạch,.... cũng nên ăn rau xà lạc thường xuyên để giảm mức độ nghiêm trọng của bệnh.\n\nRau xà lách có thể sử dụng để nấu hoặc ăn nhúng lẩu tùy vào sở thích mỗi người. Một số khẩu phần ăn kiêng thì chọn rau xà lách để làm gỏi cuốn hoặc salad xà lách rau củ. Thông thường, chúng ta có xu hướng ăn sống loại rau này nên việc lựa chọn rau có nguồn gốc và thực hiện rửa rau với nước muối trước khi dùng cần được quan tâm để tránh gây ngộ độc thực phẩm do các vi khuẩn trên rau gây ra.",
    "item_image": "lettuce",
    "item_clipart": "lettuce_clip"
  },
  {
    "item_id": 19,
    "item_name": "Limnocharis Flava",
    "item_nameVi": "Cù nèo",
    "item_nameVi2": "Cu neo",
    "item_sname": "Limnocharitaceae",
    "item_description": "Cu neo (also known as keo neo) is a wild grass that grows vigorously and adapts easily in the waterways of the Mekong Delta in Vietnam. It's unclear when cu neo first became an edible vegetable, but its taste—chewy and crunchy, with a delightful crispiness—makes it popular with both young and old alike.\n\nKeo neo has upright leaves that do not float on the water's surface and often stand taller than the flower stems. Its leaves have long stalks with a protective sheath, parallel veins, and a triangular cross-section. The leaf blade varies in shape, ranging from lanceolate to elongated elliptical or broadly oval, about 8–18 cm in length. The tip of the leaf is sharply pointed, and it narrows toward the base with a bright green color. The base is wedge-shaped, with slightly wavy leaf edges and a rippling margin. There are 4-6 main veins, nearly parallel and converging toward the tip, with numerous cross veins perpendicular to the main vein, forming a delicate lattice pattern.\n\nThe plant has 1-4 flowering stalks in an umbel-like inflorescence with 2-12 flowers enclosed by bracts. The flower stalks are slender, with an expanded, triangular cross-section at the top. Each flower has three broad oval or round yellow petals, three durable green sepals overlapping each other in a broad oval shape with a blunt tip, shorter than the petals.\n\nThe rhizome is thick and short, and the plant thrives in marshes, shallow water, and areas with stagnant water. If cultivated in a pot, the soil must be rich in organic matter. When mature, the plant reaches a height of about 45–60 cm and a maximum depth of around 15 cm.\n\nAside from its use as a vegetable, cu neo is also a medicinal herb in traditional medicine, with a sweet and cooling effect, helping to reduce heat and dampness, promote urination, ease bowel movements, and reduce inflammation. Folk remedies often use cu neo to treat urinary inflammation, nocturnal emissions and spermatorrhea in men, and leucorrhea in women.\n\nPreparing cu neo dishes in the Mekong Delta style is simple yet delicious. Fresh cu neo, eaten raw, is considered the tastiest and most nutritious when paired with kho quet (a caramelized dipping sauce) or light fish sauce. The crunchy, chewy texture of cu neo combined with the savory flavor of the dip makes for a simple but delicious dish. Alternatively, when there’s nothing else to eat, a handful of cu neo, washed and cut into pieces, can be briefly boiled and enjoyed with fermented soy sauce, fermented tofu, or regular soy sauce—perfect for polishing off a pot of plain rice. Cu neo also appears in various hot pot dishes of the Southern Vietnamese region, especially in lau mam (fermented fish hot pot) and mam kho (fermented fish stew); without cu neo (or tai tuong leaves), even with a variety of other fresh vegetables, something feels missing. Cu neo in the Mekong Delta’s sour soup also adds a unique flavor, making it more delicious. In those delicate cu neo fibers lies a subtle bitterness, mild sweetness, and even a hint of the salty taste of alluvial silt.",
    "item_descriptionVi": "Cù nèo (hay còn gọi kèo nèo) là loài cỏ dại sinh trưởng mạnh, dễ thích nghi ở miền Tây sông nước. Chẳng biết cù nèo trở thành rau ăn từ khi nào, chỉ biết vị nó rất ngon, dẻo giòn, cảm giác khi nhai rạo rạo ở kẽ răng khiến cho người già lẫn trẻ đều ưa thích.\n\nKèo nèo có lá thẳng và hướng lên, không trôi nổi trên mặt nước, thường cao hơn cán hoa. Cuống lá dài, có vỏ bọc, hệ gân song song có mặt cắt tam giác. Phiến lá có hình dạng thay đổi: dạng mác đến elip thuôn dài hoặc ovan rộng, dài từ 8–18 cm. Đỉnh lá nhọn đột ngột, ở phía đáy mỏng hơn, màu xanh sáng. Đáy là hình nêm, mép lá hơi quăn, rìa lá gợn sóng. Có 4-6 đôi gân chính và 1 rìa gần như song song và hội tụ theo hướng đỉnh, hàng loạt gân ngang song song và vuông góc với gân chính giữa tạo thành nhiều hình mắt lưới mảnh.\n\nHoa có từ 1-4 cuống cụm hoa, kiểu phát hoa dạng tán, 2-12 hoa nằm trong tổng bao là lá bắc. Cuống hoa nhỏ, có phần mở rộng và có mặt cắt tam giác ở phía trên. Mỗi hoa có 3 cánh màu vàng hình ovan rộng hoặc tròn. Có 3 đài hoa, màu xanh, bền, xếp gối lên nhau, hình ovan rộng, đỉnh tù, đài hoa ngắn hơn cánh hoa.\n\nThân rễ dày và ngắn, cây sống ở đầm lầy, nước nông, chỗ ứ đọng nước, nếu trồng trong chậu thì đất phải có nhiều mùn. Khi trưởng thành cây cao khoảng 45–60 cm và độ sâu tối đa khoảng 15 cm.\nNgoài làm rau ăn thì theo y học cổ truyền, cù nèo còn là vị thuốc có vị ngọt tính mát, tác dụng thanh thấp nhiệt, lợi tiểu, nhuận tràng, tiêu viêm. Kinh nghiệm dân gian thường dùng cù nèo chữa viêm tiết niệu, nam giới di tinh, mộng tinh, nữ giới khí hư bạch đới.\n\nChế biến rau cù nèo theo kiểu người miền Tây sông nước rất đơn giản, dân dã mà ngon. Rau cù nèo ăn sống được xem là ngon nhất, giữ được nguyên vẹn chất dinh dưỡng khi chấm với kho quẹt, nước cá kho lạt. Những cọng cù nèo giòn giòn, dẻo dẻo kết hợp với vị đậm đà của nước chấm tạo nên một món ăn tuy đơn giản nhưng ngon miệng làm sao. Hay những lúc nhà chẳng có đồ ăn, hái mớ rau cù nèo rửa sạch, cắt khúc, luộc sơ với nước sôi, vớt ra chấm với tương hột, chao, nước tương đều làm cạn đáy nồi cơm trắng. Cù nèo còn xuất hiện trong những món lẩu của người Nam Bộ. Đặc biệt là lẩu mắm, mắm kho, nếu thiếu cù nèo (hoặc rau tai tượng) thì dù cho vô vàn các loại rau sống khác cũng cảm thấy thiếu thiếu điều gì đó. Không chỉ có lẩu mắm, cù nèo trong nồi canh chua của người miền Tây cũng giúp tăng vị ngon, lạ miệng. Bởi trong thớ rau cù nèo mỏng manh ấy, có vị chát nhẹ, ngọt nhẹ và kể cả vị mặn của hương phù sa.",
    "item_image": "flava",
    "item_clipart": "flava_clip"
  },
  {
    "item_id": 20,
    "item_name": "Okra",
    "item_nameVi": "Đậu bắp",
    "item_nameVi2": "Dau bap",
    "item_sname": "Abelmoschus esculentus",
    "item_description": "Okra, also known by other names such as lady’s finger, gumbo, coffee weed, or yellow flower, originates from West Africa. Due to its excellent heat and drought resistance, okra is primarily cultivated in temperate and tropical regions, with the southern United States being one of the largest growing areas. In Vietnam, okra is also grown, especially in the southern provinces with hot climates.\n\nOkra is a fruit-bearing plant that can be grown as either an annual or perennial. Unlike other beans, mature okra pods can grow up to 8–20 cm long, have a hairy surface, and contain a significant number of seeds. Okra flowers are white or yellow with red spots near the base and typically have five petals. The pods are harvested while still young to be used in cooking. Besides the pods, the leaves of the okra plant are also edible and can be used in salads similarly to lettuce. Mature okra seeds can be roasted to create a caffeine-free coffee substitute. Interestingly, oil extracted from okra seeds has a pleasant yellow color and an agreeable flavor. These seeds contain a high oil content, with over 40%.\n\nModern research shows that all parts of the okra plant are rich in lignin and cellulose. Additionally, okra is packed with proteins, iron, calcium, zinc, potassium, manganese, and several other minerals. Okra is low in calories, with only 33 calories per 100 grams, and it contains no cholesterol or saturated fats. Therefore, okra is an ideal choice for those looking to lose weight or who have health concerns such as high blood pressure, diabetes, anemia, or constipation. With its rich nutritional content and low-calorie count, okra is a suitable food for everyone, contributing to a healthy and balanced diet.\n\nToday, okra is becoming increasingly popular and widely consumed as part of daily meals in many countries. This is not only due to its unique mucilaginous texture but also because of its tremendous nutritional value, which is especially beneficial for health. Okra is commonly used in soups, stews, stir-fries, and steamed or boiled dishes.",
    "item_descriptionVi": "Đậu bắp hay còn được gọi bằng các tên khác như mướp tây, bông vàng, bắp chà hay thảo cà phê,... có nguồn gốc từ Tây Phi. Nhờ vào khả năng chịu nóng bức và khô hạn rất tốt nên chủ yếu đậu bắp được trồng ở các vùng ôn đới hay nhiệt đới, được trồng nhiều nhất là ở miền Nam Hoa Kỳ. Đậu bắp cũng được trồng ở nước ta nhưng chủ yếu vẫn là ở các tỉnh miền Nam có khí hậu nóng bức.\n\nĐậu bắp là loại cây ăn quả, có thể trồng thành cây một năm hoặc nhiều năm. Không giống như những loại đậu khác, đậu bắp khi trưởng thành dài đến 8 – 20cm, có lông và chứa khá nhiều hạt. Hoa của cây đậu bắp có màu trắng hoặc vàng với các đốm đỏ ở phần gốc, thường có năm cánh. Quả khi còn non sẽ được thu hoạch để chế biến thành các món ăn. Ngoài lá, quả của Đậu Bắp cũng có thể ăn được. Bạn có thể sử dụng lá của loài cây này để làm các món salad tương tự như rau xà lách. Hạt Đậu Bắp khi già có thể được rang lên và tạo thành cafe không cafein. Đặc biệt, loại dầu được ép ra từ hạt Đậu Bắp có màu vàng và hương vị vô cùng dễ chịu. Hàm lượng dầu bên trong loại hạt này khá cao, lên đến hơn 40%. \n\nTheo các nghiên cứu hiện đại thì tất cả các bộ phận của cây Đậu Bắp còn chứa nhiều lignin và cellulose. Hơn nữa, loại thực phẩm này còn chứa nhiều protein, sắt, canxi, kẽm, kali, mangan cùng một số khoáng chất khác. Đậu bắp có lượng calo thấp chỉ 33 calo trong mỗi 100g, và không chứa cholesterol hoặc chất béo bão hòa. Vì vậy đậu bắp thường là một lựa chọn lý tưởng cho những ai muốn giảm cân hoặc có các vấn đề về sức khỏe như cao huyết áp, tiểu đường, thiếu máu và táo bón. Với hàm lượng dinh dưỡng phong phú và calo thấp, đậu bắp là thực phẩm phù hợp cho mọi đối tượng, góp phần hỗ trợ một chế độ ăn uống lành mạnh và cân bằng.\n\nNgày nay, quả đậu bắp ngày càng được ưa chuộng và sử dụng rộng rãi, thành một món ăn hàng ngày ở nhiều quốc gia. Không chỉ bởi mùi vị độc đáo có chất nhầy kết dính mà còn bởi giá trị dinh dưỡng vô cùng lớn đặc biệt tốt cho sức khỏe của nó. Đậu bắp thường được sử dụng trong các món canh, súp, hoặc xào, và luộc, hấp.",
    "item_image": "okra",
    "item_clipart": "okra_clip"
  },
  {
    "item_id": 21,
    "item_name": "Onion",
    "item_nameVi": "Hành tây",
    "item_nameVi2": "Hanh tay",
    "item_sname": "Allium cepa",
    "item_description": "Onion, a vegetable used for both its leaves and bulbs, has the scientific name Allium cepa L.. This type of onion can withstand cold temperatures below 10°C, making it very hardy. Onions originated from Central Asia and first appeared in ancient Persia, where they began to be cultivated and used since antiquity. The Spaniards later spread this plant to Europe, and it eventually reached Vietnam.\n\nThe onion is a herbaceous plant with a fibrous root system that develops poorly. This herbaceous plant is typically grown year-round, with many long fibrous roots. Since these roots dry out easily when uprooted, onions need to be planted in fertile, loose, and moist soil to thrive. The onion stem bulges into a bulb, which is round or slightly flattened. Inside the onion bulb are layers of sheaths that are pale green. The three basic colors of onions are yellow, purple, and white. The bulb is about the size of a small light bulb, round with a white base. Onions are larger than scallions and have a stronger flavor. The onion leaves are green, cylindrical, hollow inside, and covered with a waxy layer. They are quite pointed at the tip, similar to scallion leaves. The flowers are grayish-white, sometimes with a hint of purple or pink. Onion seeds are polygonal, black, and small.\n\nOnions not only enhance the flavor of dishes but also provide many health benefits. They are low in calories, containing about 40 calories per 3.5 ounces (100 grams). A fresh onion consists of 89% water, 9% carbohydrates, and 1.7% fiber, along with small amounts of protein and fat. Onions contain antioxidants and anti-inflammatory compounds that reduce triglycerides and cholesterol levels. Their strong anti-inflammatory properties may also help lower high blood pressure and protect against blood clots. Quercetin, a flavonoid antioxidant concentrated in onions, is a powerful anti-inflammatory substance. Therefore, it can help reduce risk factors for heart disease, such as high blood pressure.\n\nOne common issue when preparing and cutting onions is eye irritation and tearing. This occurs because cutting onions releases a gas called lachrymatory factor (LF). This gas triggers the nerves in the eyes, causing a stinging sensation, and the eyes produce tears to flush out the irritants. A tip to reduce irritation is to leave the onion root intact while cutting, as the root contains a higher concentration of these substances than the bulb. Cutting onions under running water can also prevent the gas from dissolving into the air and reaching the eyes.",
    "item_descriptionVi": "Hành tây là 1 loại rau dùng được cả phần lá và củ, có tên khoa học là Allium cepa L. Loại hành này có thể chịu lạnh dưới 100C nên sống rất dai. Hành tây có nguồn gốc từ Trung Á, xuất hiện ở nước cổ Ba Tư, bắt đầu trồng và sử dụng từ thời Thượng cổ. Sau đó loài cây này được người Tây Ban Nha lan truyền qua Châu Âu rồi phát triển đến Việt Nam.\n\nHành tây là cây thân thảo, thuộc hệ rễ chùm, phát triển kém. Loại cây thân thảo này thường được trồng quanh năm, có nhiều sợi dài. Do loại rễ này dễ khô héo khi nhổ lên nên cần phải gieo trồng ở đất màu mỡ, tơi xốp và nhiều độ ẩm thì mới phát triển tốt. Thân hành tây phình to thành hình củ, dạng tròn đều hoặc hơi dẹp. Bên trong củ hành bao gồm các lớp bẹ có màu trắng xanh. Ba màu cơ bản của hành tây gồm vàng, tím và trắng, phần củ có kích cỡ bằng một bóng đèn nhỏ, hình tròn và có màu trắng ở phần gốc. Hành tây to hơn hành lá và hương vị cũng mạnh hơn hành lá. Lá hành tây có màu xanh, hình trụ dài rỗng ở giữa ruột, có màu xanh, được phủ 1 lớp sáp và khá nhọn ở phần đỉnh giống hành lá. Hoa có màu trắng xám, đôi khi phớt tím hoặc màu hồng. Hạt hành tây hình đa giác, có màu đen gạch, khá nhỏ.\n\nHành tây vừa góp phần làm cho hương vị món ăn thêm ngon miệng, vừa cung cấp nhiều chất dinh dưỡng có lợi cho cho sức khỏe mà còn chứa hàm lượng khá ít calo, chỉ khoảng 40 calo trên mỗi 3,5 ounce (100 gram). Một củ hành tươi có 89% là nước, 9% carbs và 1,7% chất xơ, kèm theo một lượng nhỏ protein và chất béo. Chứa chất chống oxy hóa và các hợp chất chống viêm, giảm chất béo trung tính và giảm mức cholesterol. Đặc tính chống viêm mạnh của chúng cũng có thể giúp giảm tình trạng huyết áp cao và bảo vệ chống lại cục máu đông. Quercetin là một chất chống oxy hóa flavonoid tập trung nhiều trong hành tây. Vì đây là một chất chống viêm mạnh. Do đó, có thể giúp giảm các yếu tố nguy cơ bệnh tim. Chẳng hạn như tình trạng huyết áp cao.\n\nVấn đề phổ biến nhất khi sơ chế và cắt hành là kích ứng mắt và gây chảy nước mắt. Nguyên nhân là do khi bị cắt, các tế bào hành tây sẽ giải phóng một loại khí có tên lachrymatory (LF). Chúng kích hoạt tế bào thần kinh trong mắt, gây ra cảm giác châm chích. Sau đó, nước mắt được sản xuất tự nhiên để rửa trôi các chất kích thích này. Một mẹo nhỏ là bạn nên để nguyên gốc rễ của hành trong khi cắt để làm giảm kích ứng. Gốc hành tây có nồng độ các chất này cao hơn so với phần thân củ. Cắt hành dưới vòi nước chảy cũng có thể ngăn chất này hòa tan vào không khí và bay vào mắt.",
    "item_image": "onion",
    "item_clipart": "onion_clip"
  },
  {
    "item_id": 22,
    "item_name": "Pumpkin",
    "item_nameVi": "Bí rợ",
    "item_nameVi2": "Bi ro",
    "item_sname": "Cucurbita moschata Duchesne",
    "item_description": "Pumpkin, also known as bí đỏ (in Southern Vietnam dialect bí rợ), is a vine plant belonging to the Cucurbita genus, in the gourd family (Cucurbitaceae). It is a common vegetable grown in various regions of Vietnam, from the mountains to the plains. The pumpkin can be consumed when ripe, and its leaves, tender shoots, male flower buds, and young green fruits can also be cooked into delicious dishes. The ripe fruit and seeds of pumpkins are also used medicinally.\n\nThe pumpkin is an annual herbaceous plant that grows along the ground or climbs using tendrils. Its stem is covered with soft, dense hairs. The leaves are alternate, with long petioles measuring 10-20 cm, heart-shaped blades with lobes, dark green in color, and often spotted white. Both sides of the leaves are covered with fine hairs. The plant has separate male and female flowers that grow in the leaf axils. Male flowers have long, hollow pedicels measuring 10-15 cm and are large and yellow. Female flowers have short, thick pedicels with round-shaped ovaries containing many ovules, and their petals are also yellow.\n\nAmong fruits that are highly nutritious, pumpkin ranks at the top. It contains iron, potassium, phosphorus, water, plant-based protein, glucose, linoleic fatty acids, as well as vitamins C, B1, B2, B5, B6, and PP. Consuming pumpkin is highly beneficial for brain health, boosting immunity, promoting heart health, enhancing vision, improving sleep quality, and supporting skin care and weight loss.\n\nIn addition to the pumpkin fruit, the plant’s buds, flowers, shoots, and young leaves are also consumed and are considered a nutritional treasure due to their rich content of essential vitamins and minerals. Pumpkin can be processed into pumpkin milk, which is great for improving digestion, skin health, and weight gain. For diabetic patients, pumpkin is a helpful food for lowering blood sugar levels. Foods with yellow pigments, such as pumpkin, carrots, and sweet potatoes, are rich in antioxidants and beta-carotene, which help prevent cancer. Eating raw pumpkin or roasted pumpkin seeds combined with deworming medication can effectively eliminate intestinal worms.",
    "item_descriptionVi": "Bí ngô hay bí đỏ (phương ngữ Nam bộ gọi là bí rợ) là một loại cây dây thuộc chi Cucurbita, họ Bầu bí (Cucurbitaceae). Là loại rau trồng cho ăn quả, được trồng phổ biến ở nước ta từ miền núi đến trung du đến đồng bằng. Bí đỏ có thể dùng để ăn quả chín, ngoài ra lá bánh tẻ, ngọn lá non,  nụ hoa đực hay quả xanh cũng được chế biến thành những món ăn thơm ngon. Quả chín và nhân hạt của bí đỏ còn dùng làm thuốc.\n\nBí rợ là loại cây thảo sống 1 năm, mọc bò hay leo nhờ tua cuốn. Thân có lông dày, mềm. Lá mọc so le có cuống dài 10 - 20cm phiến lá hình tim chia thùy màu lục sẫm thường có đốm trắng, cả 2 mặt đều có lông mịn.  Cây có hoa đực và hoa cái mọc riêng ở kẽ lá,  Hoa đực có cuống dài và rỗng 10 - 15cm, hoa to, màu vàng. Hoa cái cuống ngắn và to dầy, bầu hình cầu chứa nhiều noãn, tràng hoa màu vàng.\n\nTrong các loại quả chứa hàm lượng dinh dưỡng cao, bí đỏ được xếp ở vị trí đầu tiên. Trong bí rợ có chứa sắt, kali, phosphor, nước, protein thực vật, gluxit,.. các axit béo linoleic, cùng các vitamin C, vitamin B1, B2, B5, B6, PP. Ăn bí đỏ rất tốt cho não bộ, làm tăng cường miễn dịch, giúp tim khỏe mạnh, mắt sáng, cho giấc ngủ ngon hơn và hỗ trợ cho việc chăm sóc da cũng như làm đẹp, giúp giảm cân...\n\t\nCây bí rợ được dùng làm thức ăn ngoài quả bí thì nụ, hoa, ngọn và lá non cũng được dùng trong bữa ăn, được coi là thực phẩm vàng bởi nó có chứa nhiều vitamin và khoáng chất cần thiết cho sức khỏe của cơ thể. Ngoài ra bí rợ chế biến sữa bí đỏ uống rất tốt, giúp tăng cân, đẹp da, tốt cho hệ tiêu hóa. Với bệnh nhân tiểu đường là thực sự là thực phẩm tốt giúp hạ đường huyết trong máu. Những thực phẩm có màu vàng như bí đỏ, cà rốt, khoai lang có chứa nhiều chất chống oxy hóa và beta- carotene ngăn ngừa các căn bệnh ung thư. Dùng bí rợ ăn sống hoặc hạt bí đỏ rang chín kết hợp với việc dùng thuốc tẩy giun sẽ đem lại hiệu quả tẩy giun cao.",
    "item_image": "pumpkin",
    "item_clipart": "pumpkin_clip"
  },
  {
    "item_id": 23,
    "item_name": "Tomato",
    "item_nameVi": "Cà chua",
    "item_nameVi2": "Ca chua",
    "item_sname": "Solanum lycopersicum",
    "item_description": "Tomatoes belong to the Solanaceae family, with plants in this family typically growing between 1 to 3 meters in height. Some are soft-stemmed, creeping along the ground or climbing over other plants. In their native habitat, these plants are perennials, but they are cultivated as annuals in temperate and tropical climates.\n\nTomatoes have a fibrous root system capable of penetrating deep into the soil, with roots reaching depths of up to 1.5 meters. The root system is primarily distributed in the topsoil layer, between 0 to 30 cm, where a dense network of secondary roots is present. Tomato roots have a strong regenerative ability, so when the main root is damaged, secondary roots take over, growing vigorously to absorb nutrients for the plant. Additionally, tomatoes have adventitious roots, primarily found on the second stem segment below the plant's cotyledon. These roots provide moderate drought tolerance, and their growth thrives when soil moisture is between 70% to 80%. Young stems are usually light purple, covered with soft hairs, and are brittle. As the plant matures, the stem turns light green, with a polygonal cross-section. The stem hardens at the base and becomes woody. Leaves and flowers develop along the stem, and axillary buds form in the leaf nodes. Tomato leaves are odd-pinnate compound leaves, with 3 to 4 pairs of leaflets per complete leaf, and the top of the leaf has a single leaflet (referred to as the terminal leaflet). The leaflets have serrated edges, with the depth of the indentations varying depending on the variety. Tomato flowers grow in clusters and are bisexual. The flower structure includes sepals, petals, stamens (male), and pistils (female), allowing for self-pollination. Tomato fruits are juicy, with shapes ranging from round, oval, to elongated depending on the variety. The fruit surface is usually smooth or has shallow grooves. A fully developed tomato fruit consists of the peel, flesh, septum, and placental tissue. Tomato seeds are small, flat, thin, and yellow. Inside the fruit, there is a substance that inhibits seed germination while still inside the fruit. On average, a tomato fruit contains 50 to 350 seeds, with 1000 seeds weighing between 2.5 to 3.5 grams.\n\nTomatoes are highly nutritious. They contain vitamins A, B, C, and D. The vitamin C in tomatoes remains largely intact after cooking, with minimal evaporation, thanks to the presence of citric acid and malic acid, which help preserve the vitamin. These acids also assist in breaking down fats. Vitamin A promotes growth in children and enhances disease resistance. Vitamin B aids digestion. Tomatoes are richer in vitamins A and C than vitamin B. Additionally, tomatoes contain essential minerals, primarily phosphorus (P) and iron (Fe).\n\nTomatoes can be eaten fresh, especially pink tomato varieties, which offer a sweet and slightly tangy taste. They can also be used in soups with meat, as a sauce base for fish, and are commonly processed into canned goods, tomato juice, dried tomatoes, or jams.",
    "item_descriptionVi": "Cà chua thuộc họ Cà, các loại cây trong họ này thường phát triển từ 1 đến 3 mét chiều cao, có những cây thân mềm bò trên mặt đất hoặc dây leo trên thân cây khác. Họ cây này là một loại cây lâu năm trong môi trường sống bản địa của nó, nhưng nay nó được trồng như một loại cây hàng năm ở các vùng khí hậu ôn đới và nhiệt đới.\n\nCà chua có bộ rễ chùm với khả năng ăn sâu vào trong đất trồng. Rễ có thể ăn sâu đến 1,5m. Hệ thống rễ phân bố chủ yếu ở tầng đất dày từ 0 – 30cm với số lượng rễ phụ cấp hai phân bố dày đặc. Rễ cà chua có khả năng tái sinh rất mạnh, khi rễ chính bị đứt thì các rễ phụ sẽ hoạt động, phát triển mạnh để hút dinh dưỡng nuôi cây. Bên cạnh đó, cà chua còn có rễ bất định tập trung chủ yếu ở đoạn thân thứ 2 dưới lá mầm của cây. Rễ cây có sức chịu hạn tương đối, khả năng phát triển của rễ tốt khi độ ẩm trong vườn trồng dao động từ 70 – 80%. Khi còn nhỏ thân cây thường có màu tím nhạt, phủ lớp lông tơ, thân giòn dễ gãy. Khi trưởng thành thân chuyển sang màu xanh nhạt, mặt cắt ngang có hình đa giác. Thân cây cứng, phần gốc hóa gỗ. Thân mang lá và hoa, ở nách lá thì phát triển thành các chồi nách. Cà chua có lá kép lông chim lẻ, trên một lá hoàn chỉnh thì có từ 3 – 4 đôi chét, ngọn lá có một lá nằm riêng (được gọi lá đỉnh). Rìa lá chét có hình răng cưa, độ nông hay sâu của rảnh sẽ phụ thuộc vào từng loại giống. Có chua có hoa mọc thành chùm, hoa lưỡng tính. Cấu tạo của hoa bao gồm lá đài, cánh hoa, nhị (đực) và nhụy (cái). Nhờ vào đặc điểm này mà hoa tự thụ là chính. Quả cà chua mọng nước, hình dạng linh hoạt theo loại giống, từ tròn, bầu dục đến dài. Vỏ quả thường nhẵn hoặc có các khía không sâu lắm. Cấu tạo của một quả hoàn chỉnh gồm có: vỏ quả, thịt quả, vách ngăn và giá noãn. Hạt cà chua có kích thước nỏ, dẹp, mỏng, màu vàng. Bên trong quả có chứa dịch chất làm kiềm hãm sự nảy mầm của hạt trong quả. Mỗi quả cà chua trung bình sẽ có 50 –350 hạt, với trọng lượng của 1000 hạt dao động 2,5 – 3,5g.  \n\nQuả cà chua có giá trị dinh dưỡng rất cao. Trong quả cà chua có các loại vitamin A, B, C, D. Vitamin C trong quả cà chua khi nấu chín vẫn giữ được phần lớn khối lượng mà chỉ bị bay hơi tương đối ít, bởi vì trong quả cà chua có các axít xitric và axít táo, là những loại axít có tác dụng bảo vệ vitamin C. Các loại axít này còn có tác dụng tiêu được các chất béo. Vitamin A thúc đẩy sự phát triển của cơ thể khi còn nhỏ và làm tăng sức chống đỡ bệnh tật. Vitamin B giúp cho tiêu hoá. Trong quả cà chua các loại vitamin A và C có nhiều hơn vitamin B. Trong quả cà chua có chất khoáng, chủ yếu là lân (P) và sắt (Fe).\n\nQuả cà chua có thể ăn tươi. Nhất là các giống cà chua hồng, quả ăn vừa ngọt, vừa dôn dốt chua thanh. Cà chua có thể nấu canh với thịt, đánh nước \"sốt\" với cá. Quả cà chua còn dùng làm nguyên liệu để chế biến đồ hộp, làm nước quả cà chua, phơi khô và làm mứt.",
    "item_image": "tomato",
    "item_clipart": "tomato_clip"
  },
  {
    "item_id": 24,
    "item_name": "Vine Spinach",
    "item_nameVi": "Mồng tơi",
    "item_nameVi2": "Mong toi",
    "item_sname": "Basella alba",
    "item_description": "Vine spinach, also known as Malabar spinach (Basella rubra L. for the purple-stemmed variety or Basella alba L. for the green-stemmed one), is a climbing leafy vegetable that belongs to the Basellaceae family. Vine spinach is commonly cultivated in Vietnam, particularly in home gardens during the summer and fall, due to its resistance to pests. This plant typically grows as a vine that can be trained to climb along fences, allowing for continuous harvesting of its leaves.\n\nThere is also a dwarf variety with larger leaves and more branches. The leaves are glossy green, heart-shaped, or ovate, and grow alternately along the stem. In late fall or winter, vine spinach blooms with clusters of flowers at the leaf axils, usually white or pale pink. Its small, egg-shaped fruits turn deep black-purple when ripe, each containing a seed. The plant can be harvested regularly for its leaves and shoots, and with good care, it can live for several years.\n\nVine spinach is highly nutritious, rich in vitamin A, vitamin B9 (folic acid), vitamin C, calcium, magnesium, iron, antioxidants, saponins, and essential amino acids like arginine, isoleucine, leucine, lysine, and tryptophan. Its vitamin C content is three times higher than that of mustard greens, and its vitamin A content is 1.5 times higher than that of kale. Some studies have reported that vine spinach has anticancer, antioxidant, and anti-inflammatory properties due to its high beta-sitosterol content.\n\nIn Do Tat Loi's book \"Những cây thuốc và vị thuốc Việt Nam\" vine spinach is classified as a plant with laxative and purgative properties. Traditional Eastern medicine describes vine spinach as cool, moist, and non-toxic, with effects that promote bowel movements and benefit the intestines. It is frequently used to treat constipation, especially in children and pregnant women. The crushed leaves or the mucilage from the plant can be applied to burns, blisters, acne, rashes, and swelling for soothing effects. In addition, the plant's stems and leaves have been reported to offer benefits such as anticancer activity (against leukemia, melanoma, and oral cancer), anti-inflammatory and antioxidant effects, treatment of anemia due to its high iron content, diuretic properties, gastrointestinal disorder treatment, and antibacterial activity.",
    "item_descriptionVi": "Rau mồng tơi (còn gọi là mùng tơi) có tên khoa học là Basella rubra L. (thân tía, gân lá tía) hoặc Basella alba L. (thân xanh), họ Mồng tơi (Basellacease). Đây là cây rau thường được người dân Việt Nam trồng trong vườn nhà để lấy rau ăn, đặc biệt vào mùa hạ và thu và có đặc tính kháng sâu bệnh tốt. Cây mồng tơi thường thấy có dạng leo, có thể cho leo hàng rào để hái lá ăn dần; hoặc giống thân lùn, lá to hơn, nhiều nhánh mọc từ kẽ. Lá mọc so le, phiến lá hình trứng hoặc hình trái tim, màu xanh bóng. Đến mùa cuối thu hoặc đông thì ra hoa thành cụm ở kẽ lá, thường có màu trắng hoặc hồng nhạt. Quả mọng nhỏ hình trứng, màu tím đen thẫm khi chín, trong chứa hạt. Cây có thể cắt lá và ngọn ăn dần, sống vài năm nếu chăm bón tốt.\n\nRau mồng tơi là loại rau giàu vitamin A, vitamin B9 (acid folic), vitamin C, calci, magie, sắt và một vài chất chống oxy hóa, chất saponin, một số acid amin thiết yếu như arginin, isoleucine, leucine, lysin, tryptophan... Vitamin C trong lá mồng tơi cao gấp 3 lần rau cải, vitamin A cao gấp 1,5 lần rau xoăn (kale). Một số nhà nghiên cứu đã báo cáo hoạt tính kháng ung thư, chống ôxy hóa và chống viêm trên thực nghiệm của rau mồng tơi do có chất beta sitosterol.\n\nRau mồng tơi được xếp vào chương Các cây thuốc và vị thuốc nhuận tràng và tẩy trong cuốn \"Những cây thuốc và vị thuốc Việt Nam\" của tác giả Đỗ Tất Lợi. Theo Đông y, rau mồng tơi có tính lạnh, hoạt, không độc; tác dụng nhuận tràng, lợi đại tiểu trường. Chỉ định điều trị thường dùng cho người bị táo bón, đại tiện khó khăn, đặc biệt ở trẻ em, phụ nữ có thai bị táo bón... Lá mồng tơi giã/vò nát hoặc chất nhầy trong rau có thể được dùng để đắp lên vết bỏng, rộp, mụn trứng cá, vết mẩn ngứa, sưng nề nhằm làm dịu vết thương. Thân và lá mồng tơi cũng được báo cáo có nhiều tác dụng như kháng ung thư (leucemia, melanoma, ung thư vùng miệng), chống viêm, chống ôxy hóa, điều trị thiếu máu (do chứa nhiều sắt), lợi tiểu, điều trị các bệnh lý đường ruột, kháng khuẩn...",
    "item_image": "vine_spinach",
    "item_clipart": "vine_spinach_clip"
  },
  {
    "item_id": 25,
    "item_name": "Water Lily",
    "item_nameVi": "Bông súng",
    "item_nameVi2": "Bong sung",
    "item_sname": "Nymphaea",
    "item_description": "The water lily is a perennial aquatic plant native to Asia and Africa. Its stem and roots grow underwater, while its leaves and flowers float on the water’s surface. The water lily’s stem is cylindrical, highly branched, and can reach up to 1 meter in length. Its roots are tuberous, ivory in color, and absorb nutrients from the water. The leaves are round, measuring 10–20 cm in diameter, with deep lobes at the base. The leaves are dark green with a paler underside, functioning in photosynthesis and CO2 absorption. The water lily’s flowers come in various colors, including white, pink, red, purple, yellow, and more. They are round, measuring 5–10 cm in diameter, serving reproductive purposes and attracting insects. Water lilies generally bloom in summer, from June to August, though some varieties, such as the Thai and American water lilies, bloom year-round. Certain species bloom all day, while others open only during the day.\n\nThe water lily not only makes a beautiful decorative addition to gardens and landscapes but also brings a harmonious touch of nature to spaces. With the soft elegance of its blooms, the water lily enhances the environment with freshness and a sense of relaxation.\n\nDuring holidays and festivals, the water lily becomes a valuable ingredient in preparing various delicious dishes. The subtlety and gentle fragrance of water lilies often add a special quality to dishes, enriching celebrations and creating unique culinary experiences.\n\nAdditionally, water lilies are used in folk medicine. With their nutritional properties and traditional medicinal benefits, water lilies are utilized in several remedies beneficial for health and wellness. This reflects the versatility of water lilies, extending beyond aesthetics to health improvements and quality of life.\n\nWater lilies are also considered an abundant food source, especially for the residents of riverine areas. They are used to prepare many unique and tasty dishes, and during the water lily season, people in the Mekong Delta often harvest them to sell for profit.\n\nSome popular specialties made from water lilies include fresh salads, quick pickles, gỏi (Vietnamese salad), boiled and dipped in fish sauce, stir-fried with garlic, sour soup, sour hot pot, pickled dishes, and bun mam (fermented fish noodle soup). Each dish has its own unique flavor—delicious, distinctive, and appealing.",
    "item_descriptionVi": "Cây hoa súng là loài cây thủy sinh sống lâu năm, có nguồn gốc từ châu Á và châu Phi. Cây có thân và rễ nằm dưới nước, còn lá và hoa nổi trên mặt nước. Thân cây hoa súng hình trụ, phân nhánh nhiều, có thể dài tới 1m. Rễ cây dạng củ, có màu trắng ngà, có tác dụng hút chất dinh dưỡng từ nước. Lá cây hoa súng hình tròn, có đường kính từ 10-20cm, xẻ thùy sâu ở gốc. Lá cây có màu xanh đậm, mặt dưới lá có màu nhạt hơn. Lá cây có tác dụng quang hợp và hấp thụ khí CO2. Hoa cây hoa súng có màu sắc đa dạng, bao gồm trắng, hồng, đỏ, tím, vàng,… Hoa súng có hình tròn, có đường kính từ 5-10cm. Hoa cây có tác dụng sinh sản và thu hút côn trùng. Cây hoa súng thường nở hoa vào mùa hè, từ tháng 6 đến tháng 8, đặc biệt dòng hoa súng thái, hoa súng mỹ lại ra hoa quanh năm. Hoa súng có thể nở cả ngày hoặc chỉ nở vào ban ngày tùy theo loài.\n\nBông súng không chỉ là một loài hoa đẹp mắt dùng để trang trí sân vườn và tiểu cảnh, mà còn là một phần quan trọng làm cho không gian trở nên hòa hợp với thiên nhiên. Với sự mềm mại và quyến rũ của những đóa hoa, bông súng không chỉ tô điểm cho môi trường xanh mà còn mang đến cảm giác tươi mới và thư giãn.\n\nTrong những dịp lễ và Tết, bông súng trở thành một nguồn nguyên liệu quý giá cho việc chế biến nhiều món ăn ngon. Sự tinh tế và hương thơm dịu dàng của bông súng thường làm cho các món ăn trở nên đặc biệt, làm phong phú thêm bữa tiệc và tạo nên trải nghiệm ẩm thực độc đáo.\n\nNgoài ra, bông súng còn được sử dụng trong nghệ thuật chữa bệnh dân gian. Với các tính chất dưỡng chất và y học truyền thống, bông súng được ứng dụng để điều chế nhiều bài thuốc hữu ích trong việc chăm sóc sức khỏe và chữa bệnh. Việc này thể hiện sự đa dạng và đa năng bông súng không chỉ trong lĩnh vực thẩm mỹ mà còn trong việc cải thiện sức khỏe và chất lượng cuộc sống.\n\nBông súng được xem là một nguồn thực phẩm dồi dào, đặc biệt là đối với những người dân vùng sông nước. Bông súng được dùng để chế biến nhiều món ăn ngon vô cùng đặc sắc, thậm chí vào mùa súng người dân vùng đồng bằng Sông Cửu Long thường đi hái về để bán và thu lợi nhuận.\n\nMột số món ngon đặc sản được chế biến từ bông súng như: Làm rau sống, bóp xổi, làm gỏi, luộc chấm mắm, xào tỏi, nấu canh chua, lẩu chua, làm dưa chua, món bún mắm…Mỗi món ăn đều mang một hương vị riêng biệt nhưng vô cùng ngon miệng, đặc sắc, hấp dẫn.",
    "item_image": "water_lily",
    "item_clipart": "water_lily_clip"
  },
  {
    "item_id": 26,
    "item_name": "Water Spinach",
    "item_nameVi": "Rau muống",
    "item_nameVi2": "Rau muong",
    "item_sname": "Ipomoea aquatica",
    "item_description": "Water spinach is an herbaceous plant that typically sprawls across water surfaces or grows on land. It has a thick, hollow stem with many nodes, each node capable of developing roots, and a smooth exterior. The stem is generally hairless in warm weather but develops hairs in colder seasons. In Vietnam, there are two main types: white-stemmed and purple-stemmed water spinach, each with unique characteristics. Both types can be cultivated on land or in water, but typically, white-stemmed water spinach is grown on land, while purple-stemmed is grown or found naturally in water, often referred to as \"field water spinach\" or \"paddy water spinach.\"\n\nThe leaves are triangular, pointed at the tip, sometimes narrow and elongated. The leaf blades measure 7–9 cm long and 3.5–7 cm wide, with smooth petioles about 3–6 mm long. Flowers are generally large, either white or pink-purple, with a light purple floral tube. Each flower stalk can bear 1–2 flowers. The fruit of water spinach is spherical, about 7–9 mm in diameter, containing brownish, hairy seeds around 4 mm wide, with each fruit containing typically 4 seeds.\n\nWater spinach is composed of 92% water, 3.2% protein, 2.5% carbohydrates, 1% cellulose, and 1.3% ash. It is rich in minerals, containing approximately 100 mg% calcium, 37 mg% phosphorus, and 1.4 mg% iron. Vitamins include 2.9% carotene, 23 mg% vitamin C, 0.10 mg% vitamin B1, 0.7% vitamin PP, and 0.09 mg% vitamin B2. It also contains a considerable amount of mucilage.\n\nA simple way to prepare water spinach is by boiling it. Depending on the region, it can be paired with fish sauce, soy sauce, fermented tofu, shrimp paste, or soy paste (especially Bần soy paste). The water from boiled water spinach is often consumed with a squeeze of lime after meals. In Vietnam, particularly in the village of Thanh Chieu (now Sen Chieu, Phuc Tho, Hanoi), there was once a meticulous method of cultivating water spinach by allowing the tips to grow coiled inside empty snail shells, resulting in tender, white, plump stems as a delicacy. Besides boiling, water spinach can be stir-fried with garlic (sometimes with a touch of shrimp paste traditionally); made into salad with crushed peanuts, vinegar, sugar, garlic, and chili; added to crab or taro soup in place of rau rút (water mimosa); served with chicken hot pot; grilled; or shredded and eaten fresh with other herbs. Each method of preparation has its distinct flavor, and the choice of preparation varies according to the preferences of different regions and cultures.",
    "item_descriptionVi": "Rau muống là cây thân thảo, thường mọc bò trên mặt nước hoặc trên cạn. Thân rỗng, dày, có nhiều đốt, có rễ ở các đốt, mặt ngoài nhẵn. Thân thường không có lông vào mùa nóng và có lông vào mùa lạnh. Ở Việt Nam, rau muống có hai loại trắng và tía, mỗi loại có đặc tính riêng. Cả hai loại đều có thể trồng trên cạn hoặc dưới nước. Thông thường thì người ta trồng rau muống trắng trên cạn; còn rau muống tía thường được trồng (hay mọc tự nhiên) dưới nước, nên tục gọi là rau muống đồng (hay rau muống ruộng)\n\nLá Rau muống có hình ba cạnh, đầu ngọn, đôi khi lá có thể thon dài, hẹp. Phiến lá dài 7 – 9 cm, rộng 3.5 – 7 cm, cuống lá thường nhẵn, không có lông dài khoảng 3 – 6 mm. Hoa thường to có màu trắng hoặc hồng tím, ống hoa màu tím nhạt. Mỗi cuống hoa có thể mọc 1 – 2 hoa. Quả Rau muống hình cầu, đường kính khoảng 7 – 9 mm, hạt có lông màu nâu, hung, đường kính hạt khoảng 4 mm. Mỗi quả thường chứa 4 hạt.\n\nRau muống có 92% nước, 3,2% protit, 2,5% gluxit, 1% xenluloza, 1,3% tro. Hàm lượng muối khoáng rất cao: trong đó có khoảng 100 mg% calci, 37 mg% phosphor, 1,4 mg% sắt. Các vitamin gồm có 2,9% caroten, 23 mg% vitamin C, 0,10 mg% vitamin B1, 0,7% vitamin PP, 0,09 mg% vitamin B2. Ngoài ra còn chứa nhiều chất nhầy.\n\nTừ rau muống, cách đơn giản nhất là luộc lên. Và tùy theo từng vùng, người ta có thể chấm với nước mắm, xì dầu, chao, mắm tép và tương (đặc biệt là tương Bần). Nước của rau muống luộc cũng thường được người dân Việt Nam uống pha với chanh sau bữa ăn. Tại Việt Nam xưa (làng Thanh Chiểu nay là Sen Chiểu - Phúc Thọ - Hà Nội) đã từng có loại rau muống được nuôi trồng rất cầu kỳ bằng cách cho ngọn rau mọc cuộn trong những chiếc vỏ ốc rỗng, để lấy những ngọn rau muống trắng nõn và mập mạp làm thức ăn... Ngoài rau muống luộc, còn có rau muống xào tỏi (có thể gia chút mắm tôm theo truyền thống); làm nộm rau muống với lạc rang giã dập, giấm, đường, tỏi, ớt; gia vào canh riêu cua hoặc canh cua khoai sọ thay cho rau rút, ăn với lẩu gà, làm rau muống nướng. Cũng thường thấy rau muống được chẻ ra ăn sống với các loại rau thơm khác. Mỗi cách đều có hương vị riêng và tùy sở thích của từng vùng, từng miền mà cách chế biến có khác nhau.",
    "item_image": "water_spinach",
    "item_clipart": "water_spinach_clip"
  }
]